// 初始数据
const rawData = `

2026-02-18
009期
17
牛/火

18
鼠/火

06
鼠/土

49
蛇/土

07
猪/木

22
猴/水

+
28
虎/土

2026-01-09
009期
17
牛/火

18
鼠/火

06
鼠/土

49
蛇/土

07
猪/木

22
猴/水

+
28
虎/土

2026-01-08
008期
05
牛/土

39
兔/火

36
马/土

19
猪/土

29
牛/水

45
鸡/木

+
21
鸡/水

2026-01-07
007期
28
虎/土

40
虎/火

45
鸡/木

34
猴/金

44
狗/水

15
兔/木

+
41
牛/金

2026-01-06
006期
35
羊/土

41
牛/金

15
兔/木

06
鼠/土

46
猴/木

21
鸡/水

+
13
蛇/水

2026-01-05
005期
46
猴/木

19
猪/土

20
狗/土

36
马/土

13
蛇/水

17
牛/火

+
43
猪/水

2026-01-04
004期
22
猴/水

19
猪/土

07
猪/木

35
羊/土

49
蛇/土

36
马/土

+
45
鸡/木

2026-01-03
003期
30
鼠/水

44
狗/水

07
猪/木

15
兔/木

42
鼠/金

17
牛/火

+
09
鸡/火

2026-01-02
002期
48
马/火

07
猪/木

04
虎/金

03
兔/金

15
兔/木

11
羊/金

+
22
猴/水

2026-01-01
001期
27
兔/土

08
狗/木

43
猪/水

33
鸡/金

42
鼠/金

11
羊/金

+
29
牛/水

2025-12-31
365期
49
蛇/土

20
狗/土

29
牛/水

33
鸡/金

10
猴/火

16
虎/木

+
26
龙/金

2025-12-30
364期
31
猪/火

22
猴/水

02
龙/火

11
羊/金

43
猪/水

28
虎/土

+
12
马/金

2025-12-29
363期
23
羊/木

21
鸡/水

13
蛇/水

04
虎/金

09
鸡/火

15
兔/木

+
26
龙/金

2025-12-28
362期
45
鸡/木

11
羊/金

37
蛇/木

06
鼠/土

30
鼠/水

08
狗/木

+
23
羊/木

2025-12-27
361期
30
鼠/水

11
羊/金

02
龙/火

38
龙/木

33
鸡/金

20
狗/土

+
24
马/木

2025-12-26
360期
27
兔/土

06
鼠/土

44
狗/水

15
兔/木

39
兔/火

12
马/金

+
41
牛/金

2025-12-25
359期
37
蛇/木

38
龙/木

06
鼠/土

23
羊/木

45
鸡/木

42
鼠/金

+
11
羊/金

2025-12-24
358期
26
龙/金

22
猴/水

43
猪/水

42
鼠/金

18
鼠/火

35
羊/土

+
07
猪/木

2025-12-23
357期
41
牛/金

35
羊/土

02
龙/火

13
蛇/水

43
猪/水

24
马/木

+
49
蛇/土

2025-12-22
356期
40
虎/火

11
羊/金

08
狗/木

36
马/土

13
蛇/水

03
兔/金

+
24
马/木

2025-12-21
355期
43
猪/水

09
鸡/火

06
鼠/土

28
虎/土

15
兔/木

30
鼠/水

+
08
狗/木

2025-12-20
354期
21
鸡/水

15
兔/木

04
虎/金

05
牛/土

28
虎/土

48
马/火

+
30
鼠/水

2025-12-19
353期
38
龙/木

06
鼠/土

16
虎/木

46
猴/木

26
龙/金

48
马/火

+
01
蛇/火

2025-12-18
352期
25
蛇/金

09
鸡/火

29
牛/水

26
龙/金

10
猴/火

02
龙/火

+
44
狗/水

2025-12-17
351期
16
虎/木

15
兔/木

03
兔/金

12
马/金

10
猴/火

11
羊/金

+
04
虎/金

2025-12-16
350期
07
猪/木

22
猴/水

42
鼠/金

35
羊/土

16
虎/木

47
羊/火

+
49
蛇/土

2025-12-15
349期
33
鸡/金

11
羊/金

39
兔/火

04
虎/金

40
虎/火

46
猴/木

+
22
猴/水

2025-12-14
348期
31
猪/火

26
龙/金

44
狗/水

21
鸡/水

22
猴/水

34
猴/金

+
16
虎/木

2025-12-13
347期
30
鼠/水

08
狗/木

26
龙/金

37
蛇/木

28
虎/土

24
马/木

+
13
蛇/水

2025-12-12
346期
11
羊/金

26
龙/金

40
虎/火

46
猴/木

34
猴/金

20
狗/土

+
03
兔/金

2025-12-11
345期
41
牛/金

23
羊/木

09
鸡/火

11
羊/金

32
狗/火

03
兔/金

+
24
马/木

2025-12-10
344期
11
羊/金

21
鸡/水

42
鼠/金

10
猴/火

47
羊/火

40
虎/火

+
27
兔/土

2025-12-09
343期
11
羊/金

45
鸡/木

41
牛/金

28
虎/土

46
猴/木

35
羊/土

+
38
龙/木

2025-12-08
342期
41
牛/金

19
猪/土

17
牛/火

15
兔/木

24
马/木

08
狗/木

+
04
虎/金

2025-12-07
341期
05
牛/土

34
猴/金

42
鼠/金

07
猪/木

35
羊/土

12
马/金

+
06
鼠/土

2025-12-06
340期
45
鸡/木

17
牛/火

15
兔/木

28
虎/土

22
猴/水

10
猴/火

+
16
虎/木

2025-12-05
339期
24
马/木

22
猴/水

40
虎/火

36
马/土

39
兔/火

31
猪/火

+
48
马/火

2025-12-04
338期
41
牛/金

48
马/火

34
猴/金

15
兔/木

25
蛇/金

10
猴/火

+
08
狗/木

2025-12-03
337期
13
蛇/水

44
狗/水

42
鼠/金

24
马/木

32
狗/火

14
龙/水

+
09
鸡/火

2025-12-02
336期
20
狗/土

06
鼠/土

15
兔/木

10
猴/火

13
蛇/水

42
鼠/金

+
17
牛/火

2025-12-01
335期
34
猴/金

35
羊/土

46
猴/木

31
猪/火

13
蛇/水

03
兔/金

+
44
狗/水

2025-11-30
334期
35
羊/土

29
牛/水

41
牛/金

33
鸡/金

01
蛇/火

49
蛇/土

+
46
猴/木

2025-11-29
333期
43
猪/水

31
猪/火

36
马/土

11
羊/金

37
蛇/木

27
兔/土

+
06
鼠/土

2025-11-28
332期
44
狗/水

23
羊/木

45
鸡/木

30
鼠/水

19
猪/土

08
狗/木

+
26
龙/金

2025-11-27
331期
42
鼠/金

24
马/木

02
龙/火

22
猴/水

47
羊/火

21
鸡/水

+
26
龙/金

2025-11-26
330期
20
狗/土

37
蛇/木

32
狗/火

01
蛇/火

11
羊/金

06
鼠/土

+
36
马/土

2025-11-25
329期
46
猴/木

13
蛇/水

44
狗/水

37
蛇/木

45
鸡/木

19
猪/土

+
17
牛/火

2025-11-24
328期
28
虎/土

34
猴/金

13
蛇/水

08
狗/木

22
猴/水

15
兔/木

+
03
兔/金

2025-11-23
327期
13
蛇/水

44
狗/水

09
鸡/火

21
鸡/水

31
猪/火

22
猴/水

+
37
蛇/木

2025-11-22
326期
23
羊/木

04
虎/金

46
猴/木

11
羊/金

33
鸡/金

31
猪/火

+
19
猪/土

2025-11-21
325期
12
马/金

02
龙/火

33
鸡/金

05
牛/土

17
牛/火

49
蛇/土

+
04
虎/金

2025-11-20
324期
49
蛇/土

30
鼠/水

31
猪/火

38
龙/木

10
猴/火

28
虎/土

+
15
兔/木

2025-11-19
323期
48
马/火

28
虎/土

29
牛/水

36
马/土

46
猴/木

19
猪/土

+
09
鸡/火

2025-11-18
322期
46
猴/木

06
鼠/土

34
猴/金

17
牛/火

33
鸡/金

29
牛/水

+
47
羊/火

2025-11-17
321期
28
虎/土

08
狗/木

34
猴/金

25
蛇/金

24
马/木

10
猴/火

+
23
羊/木

2025-11-16
320期
33
鸡/金

40
虎/火

20
狗/土

48
马/火

34
猴/金

07
猪/木

+
28
虎/土

2025-11-15
319期
29
牛/水

22
猴/水

16
虎/木

31
猪/火

21
鸡/水

17
牛/火

+
45
鸡/木

2025-11-14
318期
26
龙/金

22
猴/水

20
狗/土

30
鼠/水

46
猴/木

07
猪/木

+
06
鼠/土

2025-11-13
317期
05
牛/土

10
猴/火

03
兔/金

06
鼠/土

01
蛇/火

32
狗/火

+
18
鼠/火

2025-11-12
316期
20
狗/土

29
牛/水

40
虎/火

42
鼠/金

17
牛/火

25
蛇/金

+
24
马/木

2025-11-11
315期
19
猪/土

43
猪/水

20
狗/土

15
兔/木

08
狗/木

37
蛇/木

+
04
虎/金

2025-11-10
314期
29
牛/水

44
狗/水

37
蛇/木

19
猪/土

26
龙/金

38
龙/木

+
23
羊/木

2025-11-09
313期
03
兔/金

29
牛/水

10
猴/火

39
兔/火

49
蛇/土

22
猴/水

+
38
龙/木

2025-11-08
312期
46
猴/木

18
鼠/火

47
羊/火

35
羊/土

03
兔/金

01
蛇/火

+
14
龙/水

2025-11-07
311期
06
鼠/土

39
兔/火

32
狗/火

04
虎/金

07
猪/木

02
龙/火

+
37
蛇/木

2025-11-06
310期
49
蛇/土

04
虎/金

09
鸡/火

17
牛/火

10
猴/火

43
猪/水

+
16
虎/木

2025-11-05
309期
49
蛇/土

07
猪/木

16
虎/木

13
蛇/水

32
狗/火

04
虎/金

+
06
鼠/土

2025-11-04
308期
45
鸡/木

48
马/火

46
猴/木

14
龙/水

40
虎/火

01
蛇/火

+
39
兔/火

2025-11-03
307期
21
鸡/水

44
狗/水

04
虎/金

24
马/木

29
牛/水

01
蛇/火

+
20
狗/土

2025-11-02
306期
10
猴/火

22
猴/水

07
猪/木

09
鸡/火

38
龙/木

04
虎/金

+
17
牛/火

2025-11-01
305期
33
鸡/金

24
马/木

29
牛/水

45
鸡/木

11
羊/金

27
兔/土

+
42
鼠/金

2025-10-31
304期
12
马/金

47
羊/火

43
猪/水

34
猴/金

39
兔/火

19
猪/土

+
48
马/火

2025-10-30
303期
02
龙/火

18
鼠/火

31
猪/火

27
兔/土

47
羊/火

36
马/土

+
15
兔/木

2025-10-29
302期
07
猪/木

27
兔/土

06
鼠/土

45
鸡/木

29
牛/水

42
鼠/金

+
22
猴/水

2025-10-28
301期
47
羊/火

10
猴/火

09
鸡/火

38
龙/木

41
牛/金

45
鸡/木

+
05
牛/土

2025-10-27
300期
17
牛/火

32
狗/火

39
兔/火

26
龙/金

29
牛/水

24
马/木

+
40
虎/火

2025-10-26
299期
33
鸡/金

39
兔/火

35
羊/土

13
蛇/水

31
猪/火

19
猪/土

+
49
蛇/土

2025-10-25
298期
22
猴/水

20
狗/土

49
蛇/土

37
蛇/木

39
兔/火

35
羊/土

+
23
羊/木

2025-10-24
297期
43
猪/水

24
马/木

11
羊/金

41
牛/金

01
蛇/火

19
猪/土

+
44
狗/水

2025-10-23
296期
31
猪/火

29
牛/水

23
羊/木

05
牛/土

49
蛇/土

17
牛/火

+
22
猴/水

2025-10-22
295期
18
鼠/火

04
虎/金

45
鸡/木

33
鸡/金

42
鼠/金

38
龙/木

+
05
牛/土

2025-10-21
294期
11
羊/金

08
狗/木

35
羊/土

14
龙/水

10
猴/火

38
龙/木

+
18
鼠/火

2025-10-20
293期
18
鼠/火

11
羊/金

20
狗/土

46
猴/木

01
蛇/火

14
龙/水

+
47
羊/火

2025-10-19
292期
31
猪/火

04
虎/金

28
虎/土

40
虎/火

37
蛇/木

10
猴/火

+
02
龙/火

2025-10-18
291期
43
猪/水

24
马/木

06
鼠/土

10
猴/火

30
鼠/水

25
蛇/金

+
44
狗/水

2025-10-17
290期
40
虎/火

18
鼠/火

25
蛇/金

05
牛/土

02
龙/火

17
牛/火

+
19
猪/土

2025-10-16
289期
35
羊/土

04
虎/金

23
羊/木

10
猴/火

44
狗/水

24
马/木

+
42
鼠/金

2025-10-15
288期
44
狗/水

08
狗/木

17
牛/火

01
蛇/火

02
龙/火

47
羊/火

+
14
龙/水

2025-10-14
287期
05
牛/土

42
鼠/金

49
蛇/土

10
猴/火

40
虎/火

36
马/土

+
34
猴/金

2025-10-13
286期
25
蛇/金

27
兔/土

24
马/木

16
虎/木

15
兔/木

42
鼠/金

+
03
兔/金

2025-10-12
285期
46
猴/木

25
蛇/金

37
蛇/木

15
兔/木

41
牛/金

28
虎/土

+
24
马/木

2025-10-11
284期
21
鸡/水

06
鼠/土

12
马/金

13
蛇/水

49
蛇/土

38
龙/木

+
41
牛/金

2025-10-10
283期
21
鸡/水

24
马/木

35
羊/土

08
狗/木

29
牛/水

18
鼠/火

+
45
鸡/木

2025-10-09
282期
04
虎/金

33
鸡/金

25
蛇/金

30
鼠/水

38
龙/木

12
马/金

+
41
牛/金

2025-10-08
281期
37
蛇/木

07
猪/木

10
猴/火

13
蛇/水

23
羊/木

36
马/土

+
47
羊/火

2025-10-07
280期
36
马/土

49
蛇/土

44
狗/水

32
狗/火

35
羊/土

28
虎/土

+
42
鼠/金

2025-10-06
279期
37
蛇/木

01
蛇/火

26
龙/金

42
鼠/金

39
兔/火

30
鼠/水

+
27
兔/土

2025-10-05
278期
04
虎/金

18
鼠/火

33
鸡/金

34
猴/金

45
鸡/木

39
兔/火

+
28
虎/土

2025-10-04
277期
46
猴/木

11
羊/金

41
牛/金

33
鸡/金

48
马/火

37
蛇/木

+
16
虎/木

2025-10-03
276期
16
虎/木

22
猴/水

34
猴/金

13
蛇/水

21
鸡/水

25
蛇/金

+
09
鸡/火

2025-10-02
275期
34
猴/金

47
羊/火

25
蛇/金

21
鸡/水

28
虎/土

05
牛/土

+
45
鸡/木

2025-10-01
274期
41
牛/金

20
狗/土

19
猪/土

22
猴/水

39
兔/火

40
虎/火

+
44
狗/水

2025-09-30
273期
02
龙/火

43
猪/水

19
猪/土

34
猴/金

22
猴/水

49
蛇/土

+
04
虎/金

2025-09-29
272期
01
蛇/火

04
虎/金

29
牛/水

41
牛/金

10
猴/火

21
鸡/水

+
36
马/土

2025-09-28
271期
48
马/火

03
兔/金

44
狗/水

27
兔/土

08
狗/木

09
鸡/火

+
06
鼠/土

2025-09-27
270期
05
牛/土

11
羊/金

31
猪/火

46
猴/木

03
兔/金

10
猴/火

+
35
羊/土

2025-09-26
269期
17
牛/火

02
龙/火

33
鸡/金

38
龙/木

46
猴/木

21
鸡/水

+
31
猪/火

2025-09-25
268期
39
兔/火

27
兔/土

01
蛇/火

45
鸡/木

05
牛/土

31
猪/火

+
10
猴/火

2025-09-24
267期
07
猪/木

09
鸡/火

05
牛/土

25
蛇/金

48
马/火

40
虎/火

+
29
牛/水

2025-09-23
266期
01
蛇/火

18
鼠/火

13
蛇/水

43
猪/水

26
龙/金

40
虎/火

+
41
牛/金

2025-09-22
265期
44
狗/水

34
猴/金

48
马/火

06
鼠/土

23
羊/木

01
蛇/火

+
10
猴/火

2025-09-21
264期
23
羊/木

33
鸡/金

06
鼠/土

32
狗/火

19
猪/土

47
羊/火

+
43
猪/水

2025-09-20
263期
39
兔/火

48
马/火

03
兔/金

20
狗/土

25
蛇/金

43
猪/水

+
38
龙/木

2025-09-19
262期
16
虎/木

27
兔/土

28
虎/土

33
鸡/金

12
马/金

38
龙/木

+
44
狗/水

2025-09-18
261期
37
蛇/木

34
猴/金

09
鸡/火

46
猴/木

16
虎/木

30
鼠/水

+
33
鸡/金

2025-09-17
260期
44
狗/水

11
羊/金

40
虎/火

24
马/木

12
马/金

28
虎/土

+
03
兔/金

2025-09-16
259期
08
狗/木

38
龙/木

30
鼠/水

45
鸡/木

09
鸡/火

42
鼠/金

+
47
羊/火

2025-09-15
258期
01
蛇/火

26
龙/金

35
羊/土

25
蛇/金

47
羊/火

17
牛/火

+
38
龙/木

2025-09-14
257期
23
羊/木

21
鸡/水

04
虎/金

01
蛇/火

30
鼠/水

11
羊/金

+
28
虎/土

2025-09-13
256期
42
鼠/金

36
马/土

11
羊/金

09
鸡/火

45
鸡/木

05
牛/土

+
48
马/火

2025-09-12
255期
15
兔/木

21
鸡/水

20
狗/土

25
蛇/金

24
马/木

39
兔/火

+
42
鼠/金

2025-09-11
254期
27
兔/土

12
马/金

29
牛/水

32
狗/火

44
狗/水

19
猪/土

+
17
牛/火

2025-09-10
253期
06
鼠/土

39
兔/火

19
猪/土

08
狗/木

30
鼠/水

37
蛇/木

+
33
鸡/金

2025-09-09
252期
01
蛇/火

43
猪/水

49
蛇/土

10
猴/火

35
羊/土

40
虎/火

+
23
羊/木

2025-09-08
251期
06
鼠/土

18
鼠/火

12
马/金

36
马/土

05
牛/土

15
兔/木

+
35
羊/土

2025-09-07
250期
47
羊/火

03
兔/金

34
猴/金

11
羊/金

33
鸡/金

35
羊/土

+
12
马/金

2025-09-06
249期
37
蛇/木

19
猪/土

48
马/火

09
鸡/火

04
虎/金

01
蛇/火

+
02
龙/火

2025-09-05
248期
27
兔/土

42
鼠/金

24
马/木

34
猴/金

20
狗/土

39
兔/火

+
12
马/金

2025-09-04
247期
38
龙/木

10
猴/火

01
蛇/火

44
狗/水

15
兔/木

03
兔/金

+
25
蛇/金

2025-09-03
246期
14
龙/水

18
鼠/火

16
虎/木

26
龙/金

01
蛇/火

23
羊/木

+
06
鼠/土

2025-09-02
245期
34
猴/金

37
蛇/木

19
猪/土

29
牛/水

14
龙/水

38
龙/木

+
44
狗/水

2025-09-01
244期
04
虎/金

16
虎/木

25
蛇/金

07
猪/木

22
猴/水

12
马/金

+
24
马/木

2025-08-31
243期
15
兔/木

47
羊/火

23
羊/木

16
虎/木

27
兔/土

42
鼠/金

+
08
狗/木

2025-08-30
242期
46
猴/木

33
鸡/金

26
龙/金

09
鸡/火

05
牛/土

07
猪/木

+
34
猴/金

2025-08-29
241期
22
猴/水

38
龙/木

11
羊/金

29
牛/水

43
猪/水

09
鸡/火

+
01
蛇/火

2025-08-28
240期
04
虎/金

42
鼠/金

25
蛇/金

24
马/木

22
猴/水

09
鸡/火

+
28
虎/土

2025-08-27
239期
12
马/金

13
蛇/水

01
蛇/火

05
牛/土

29
牛/水

48
马/火

+
04
虎/金

2025-08-26
238期
10
猴/火

43
猪/水

34
猴/金

15
兔/木

09
鸡/火

48
马/火

+
46
猴/木

2025-08-25
237期
49
蛇/土

25
蛇/金

10
猴/火

03
兔/金

37
蛇/木

17
牛/火

+
02
龙/火

2025-08-24
236期
46
猴/木

18
鼠/火

45
鸡/木

42
鼠/金

49
蛇/土

09
鸡/火

+
39
兔/火

2025-08-23
235期
45
鸡/木

43
猪/水

12
马/金

36
马/土

49
蛇/土

02
龙/火

+
42
鼠/金

2025-08-22
234期
14
龙/水

18
鼠/火

43
猪/水

23
羊/木

11
羊/金

16
虎/木

+
13
蛇/水

2025-08-21
233期
43
猪/水

29
牛/水

27
兔/土

18
鼠/火

45
鸡/木

06
鼠/土

+
37
蛇/木

2025-08-20
232期
49
蛇/土

40
虎/火

19
猪/土

44
狗/水

18
鼠/火

23
羊/木

+
42
鼠/金

2025-08-19
231期
16
虎/木

23
羊/木

05
牛/土

08
狗/木

35
羊/土

31
猪/火

+
38
龙/木

2025-08-18
230期
15
兔/木

10
猴/火

01
蛇/火

46
猴/木

48
马/火

08
狗/木

+
39
兔/火

2025-08-17
229期
41
牛/金

36
马/土

48
马/火

42
鼠/金

28
虎/土

06
鼠/土

+
02
龙/火

2025-08-16
228期
45
鸡/木

20
狗/土

40
虎/火

46
猴/木

26
龙/金

16
虎/木

+
15
兔/木

2025-08-15
227期
07
猪/木

11
羊/金

27
兔/土

19
猪/土

28
虎/土

43
猪/水

+
40
虎/火

2025-08-14
226期
13
蛇/水

27
兔/土

26
龙/金

02
龙/火

06
鼠/土

43
猪/水

+
31
猪/火

2025-08-13
225期
45
鸡/木

24
马/木

13
蛇/水

44
狗/水

09
鸡/火

47
羊/火

+
32
狗/火

2025-08-12
224期
19
猪/土

09
鸡/火

37
蛇/木

07
猪/木

49
蛇/土

13
蛇/水

+
16
虎/木

2025-08-11
223期
46
猴/木

41
牛/金

44
狗/水

07
猪/木

34
猴/金

24
马/木

+
25
蛇/金

2025-08-10
222期
46
猴/木

40
虎/火

21
鸡/水

13
蛇/水

01
蛇/火

05
牛/土

+
43
猪/水

2025-08-09
221期
46
猴/木

27
兔/土

15
兔/木

23
羊/木

25
蛇/金

12
马/金

+
08
狗/木

2025-08-08
220期
35
羊/土

28
虎/土

14
龙/水

11
羊/金

10
猴/火

43
猪/水

+
08
狗/木

2025-08-07
219期
04
虎/金

25
蛇/金

23
羊/木

46
猴/木

16
虎/木

41
牛/金

+
09
鸡/火

2025-08-06
218期
22
猴/水

32
狗/火

36
马/土

34
猴/金

26
龙/金

38
龙/木

+
23
羊/木

2025-08-05
217期
18
鼠/火

03
兔/金

39
兔/火

37
蛇/木

08
狗/木

11
羊/金

+
46
猴/木

2025-08-04
216期
48
马/火

07
猪/木

20
狗/土

12
马/金

17
牛/火

46
猴/木

+
23
羊/木

2025-08-03
215期
33
鸡/金

11
羊/金

19
猪/土

15
兔/木

36
马/土

13
蛇/水

+
21
鸡/水

2025-08-02
214期
22
猴/水

48
马/火

38
龙/木

28
虎/土

01
蛇/火

19
猪/土

+
15
兔/木

2025-08-01
213期
03
兔/金

31
猪/火

34
猴/金

38
龙/木

47
羊/火

24
马/木

+
11
羊/金

2025-07-31
212期
05
牛/土

12
马/金

25
蛇/金

35
羊/土

36
马/土

20
狗/土

+
18
鼠/火

2025-07-30
211期
39
兔/火

01
蛇/火

14
龙/水

27
兔/土

24
马/木

12
马/金

+
02
龙/火

2025-07-29
210期
35
羊/土

40
虎/火

47
羊/火

11
羊/金

24
马/木

14
龙/水

+
15
兔/木

2025-07-28
209期
31
猪/火

08
狗/木

32
狗/火

26
龙/金

48
马/火

02
龙/火

+
13
蛇/水

2025-07-27
208期
31
猪/火

17
牛/火

48
马/火

24
马/木

32
狗/火

29
牛/水

+
09
鸡/火

2025-07-26
207期
09
鸡/火

27
兔/土

06
鼠/土

01
蛇/火

49
蛇/土

45
鸡/木

+
24
马/木

2025-07-25
206期
35
羊/土

11
羊/金

27
兔/土

19
猪/土

28
虎/土

20
狗/土

+
10
猴/火

2025-07-24
205期
23
羊/木

04
虎/金

12
马/金

06
鼠/土

37
蛇/木

30
鼠/水

+
01
蛇/火

2025-07-23
204期
07
猪/木

47
羊/火

15
兔/木

41
牛/金

18
鼠/火

36
马/土

+
30
鼠/水

2025-07-22
203期
27
兔/土

23
羊/木

39
兔/火

10
猴/火

12
马/金

44
狗/水

+
18
鼠/火

2025-07-21
202期
17
牛/火

33
鸡/金

09
鸡/火

48
马/火

44
狗/水

05
牛/土

+
20
狗/土

2025-07-20
201期
05
牛/土

30
鼠/水

01
蛇/火

37
蛇/木

25
蛇/金

46
猴/木

+
47
羊/火

2025-07-19
200期
22
猴/水

21
鸡/水

42
鼠/金

41
牛/金

11
羊/金

15
兔/木

+
47
羊/火

2025-07-18
199期
37
蛇/木

32
狗/火

05
牛/土

21
鸡/水

13
蛇/水

11
羊/金

+
10
猴/火

2025-07-17
198期
33
鸡/金

03
兔/金

07
猪/木

45
鸡/木

39
兔/火

15
兔/木

+
43
猪/水

2025-07-16
197期
15
兔/木

25
蛇/金

10
猴/火

43
猪/水

12
马/金

24
马/木

+
34
猴/金

2025-07-15
196期
31
猪/火

33
鸡/金

27
兔/土

21
鸡/水

09
鸡/火

12
马/金

+
14
龙/水

2025-07-14
195期
22
猴/水

12
马/金

42
鼠/金

08
狗/木

06
鼠/土

27
兔/土

+
25
蛇/金

2025-07-13
194期
11
羊/金

30
鼠/水

46
猴/木

43
猪/水

03
兔/金

07
猪/木

+
29
牛/水

2025-07-12
193期
17
牛/火

16
虎/木

04
虎/金

14
龙/水

06
鼠/土

42
鼠/金

+
24
马/木

2025-07-11
192期
19
猪/土

31
猪/火

10
猴/火

46
猴/木

20
狗/土

03
兔/金

+
45
鸡/木

2025-07-10
191期
33
鸡/金

41
牛/金

40
虎/火

24
马/木

37
蛇/木

18
鼠/火

+
29
牛/水

2025-07-09
190期
08
狗/木

24
马/木

03
兔/金

36
马/土

49
蛇/土

25
蛇/金

+
18
鼠/火

2025-07-08
189期
11
羊/金

36
马/土

03
兔/金

39
兔/火

48
马/火

41
牛/金

+
17
牛/火

2025-07-07
188期
03
兔/金

07
猪/木

13
蛇/水

49
蛇/土

32
狗/火

35
羊/土

+
15
兔/木

2025-07-06
187期
07
猪/木

31
猪/火

18
鼠/火

14
龙/水

26
龙/金

04
虎/金

+
45
鸡/木

2025-07-05
186期
13
蛇/水

40
虎/火

22
猴/水

20
狗/土

17
牛/火

09
鸡/火

+
08
狗/木

2025-07-04
185期
22
猴/水

40
虎/火

29
牛/水

45
鸡/木

11
羊/金

01
蛇/火

+
05
牛/土

2025-07-03
184期
08
狗/木

32
狗/火

20
狗/土

30
鼠/水

18
鼠/火

35
羊/土

+
28
虎/土

2025-07-02
183期
12
马/金

39
兔/火

38
龙/木

07
猪/木

28
虎/土

45
鸡/木

+
33
鸡/金

2025-07-01
182期
01
蛇/火

49
蛇/土

21
鸡/水

39
兔/火

06
鼠/土

34
猴/金

+
42
鼠/金

2025-06-30
181期
10
猴/火

21
鸡/水

40
虎/火

37
蛇/木

02
龙/火

39
兔/火

+
23
羊/木

2025-06-29
180期
14
龙/水

37
蛇/木

28
虎/土

43
猪/水

01
蛇/火

41
牛/金

+
29
牛/水

2025-06-28
179期
42
鼠/金

08
狗/木

05
牛/土

30
鼠/水

29
牛/水

25
蛇/金

+
24
马/木

2025-06-27
178期
42
鼠/金

30
鼠/水

37
蛇/木

20
狗/土

06
鼠/土

07
猪/木

+
27
兔/土

2025-06-26
177期
31
猪/火

30
鼠/水

11
羊/金

49
蛇/土

22
猴/水

41
牛/金

+
04
虎/金

2025-06-25
176期
12
马/金

05
牛/土

24
马/木

28
虎/土

22
猴/水

17
牛/火

+
36
马/土

2025-06-24
175期
37
蛇/木

03
兔/金

32
狗/火

12
马/金

08
狗/木

29
牛/水

+
30
鼠/水

2025-06-23
174期
11
羊/金

36
马/土

22
猴/水

24
马/木

20
狗/土

12
马/金

+
39
兔/火

2025-06-22
173期
46
猴/木

32
狗/火

30
鼠/水

05
牛/土

42
鼠/金

04
虎/金

+
38
龙/木

2025-06-21
172期
03
兔/金

15
兔/木

04
虎/金

39
兔/火

02
龙/火

28
虎/土

+
36
马/土

2025-06-20
171期
15
兔/木

04
虎/金

23
羊/木

36
马/土

27
兔/土

07
猪/木

+
47
羊/火

2025-06-19
170期
22
猴/水

20
狗/土

36
马/土

44
狗/水

31
猪/火

19
猪/土

+
33
鸡/金

2025-06-18
169期
11
羊/金

02
龙/火

32
狗/火

38
龙/木

29
牛/水

31
猪/火

+
07
猪/木

2025-06-17
168期
31
猪/火

07
猪/木

40
虎/火

15
兔/木

09
鸡/火

25
蛇/金

+
16
虎/木

2025-06-16
167期
11
羊/金

27
兔/土

30
鼠/水

06
鼠/土

36
马/土

03
兔/金

+
09
鸡/火

2025-06-15
166期
30
鼠/水

38
龙/木

18
鼠/火

14
龙/水

42
鼠/金

16
虎/木

+
41
牛/金

2025-06-14
165期
23
羊/木

37
蛇/木

17
牛/火

08
狗/木

42
鼠/金

49
蛇/土

+
47
羊/火

2025-06-13
164期
46
猴/木

38
龙/木

14
龙/水

39
兔/火

26
龙/金

08
狗/木

+
13
蛇/水

2025-06-12
163期
38
龙/木

18
鼠/火

43
猪/水

29
牛/水

10
猴/火

32
狗/火

+
23
羊/木

2025-06-11
162期
38
龙/木

02
龙/火

22
猴/水

48
马/火

15
兔/木

12
马/金

+
01
蛇/火

2025-06-10
161期
49
蛇/土

41
牛/金

44
狗/水

29
牛/水

38
龙/木

18
鼠/火

+
16
虎/木

2025-06-09
160期
23
羊/木

42
鼠/金

32
狗/火

46
猴/木

30
鼠/水

40
虎/火

+
11
羊/金

2025-06-08
159期
45
鸡/木

34
猴/金

35
羊/土

22
猴/水

24
马/木

08
狗/木

+
31
猪/火

2025-06-07
158期
15
兔/木

48
马/火

04
虎/金

17
牛/火

42
鼠/金

21
鸡/水

+
05
牛/土

2025-06-06
157期
37
蛇/木

05
牛/土

16
虎/木

12
马/金

17
牛/火

03
兔/金

+
23
羊/木

2025-06-05
156期
15
兔/木

13
蛇/水

38
龙/木

17
牛/火

28
虎/土

32
狗/火

+
18
鼠/火

2025-06-04
155期
06
鼠/土

34
猴/金

33
鸡/金

12
马/金

37
蛇/木

20
狗/土

+
45
鸡/木

2025-06-03
154期
37
蛇/木

18
鼠/火

45
鸡/木

25
蛇/金

47
羊/火

42
鼠/金

+
26
龙/金

2025-06-02
153期
42
鼠/金

11
羊/金

25
蛇/金

08
狗/木

45
鸡/木

09
鸡/火

+
43
猪/水

2025-06-01
152期
09
鸡/火

34
猴/金

17
牛/火

29
牛/水

35
羊/土

12
马/金

+
10
猴/火

2025-05-31
151期
29
牛/水

49
蛇/土

26
龙/金

25
蛇/金

35
羊/土

39
兔/火

+
38
龙/木

2025-05-30
150期
24
马/木

43
猪/水

18
鼠/火

31
猪/火

45
鸡/木

12
马/金

+
40
虎/火

2025-05-29
149期
44
狗/水

43
猪/水

25
蛇/金

03
兔/金

29
牛/水

19
猪/土

+
41
牛/金

2025-05-28
148期
48
马/火

26
龙/金

05
牛/土

31
猪/火

44
狗/水

09
鸡/火

+
02
龙/火

2025-05-27
147期
47
羊/火

14
龙/水

38
龙/木

26
龙/金

19
猪/土

35
羊/土

+
32
狗/火

2025-05-26
146期
24
马/木

41
牛/金

25
蛇/金

03
兔/金

11
羊/金

47
羊/火

+
14
龙/水

2025-05-25
145期
30
鼠/水

25
蛇/金

29
牛/水

28
虎/土

10
猴/火

49
蛇/土

+
17
牛/火

2025-05-24
144期
36
马/土

31
猪/火

19
猪/土

01
蛇/火

34
猴/金

29
牛/水

+
25
蛇/金

2025-05-23
143期
27
兔/土

19
猪/土

17
牛/火

02
龙/火

24
马/木

15
兔/木

+
10
猴/火

2025-05-22
142期
17
牛/火

30
鼠/水

08
狗/木

29
牛/水

23
羊/木

33
鸡/金

+
44
狗/水

2025-05-21
141期
30
鼠/水

22
猴/水

31
猪/火

34
猴/金

39
兔/火

03
兔/金

+
13
蛇/水

2025-05-20
140期
22
猴/水

45
鸡/木

02
龙/火

41
牛/金

39
兔/火

31
猪/火

+
11
羊/金

2025-05-19
139期
38
龙/木

27
兔/土

47
羊/火

30
鼠/水

45
鸡/木

09
鸡/火

+
14
龙/水

2025-05-18
138期
20
狗/土

27
兔/土

39
兔/火

47
羊/火

29
牛/水

03
兔/金

+
41
牛/金

2025-05-17
137期
39
兔/火

35
羊/土

46
猴/木

25
蛇/金

48
马/火

45
鸡/木

+
36
马/土

2025-05-16
136期
31
猪/火

23
羊/木

25
蛇/金

33
鸡/金

02
龙/火

21
鸡/水

+
09
鸡/火

2025-05-15
135期
32
狗/火

44
狗/水

25
蛇/金

03
兔/金

34
猴/金

33
鸡/金

+
37
蛇/木

2025-05-14
134期
38
龙/木

27
兔/土

04
虎/金

23
羊/木

06
鼠/土

34
猴/金

+
14
龙/水

2025-05-13
133期
45
鸡/木

03
兔/金

16
虎/木

01
蛇/火

21
鸡/水

38
龙/木

+
10
猴/火

2025-05-12
132期
24
马/木

46
猴/木

26
龙/金

42
鼠/金

15
兔/木

35
羊/土

+
02
龙/火

2025-05-11
131期
13
蛇/水

44
狗/水

04
虎/金

20
狗/土

36
马/土

30
鼠/水

+
47
羊/火

2025-05-10
130期
20
狗/土

30
鼠/水

10
猴/火

33
鸡/金

28
虎/土

08
狗/木

+
23
羊/木

2025-05-09
129期
34
猴/金

45
鸡/木

20
狗/土

42
鼠/金

19
猪/土

25
蛇/金

+
40
虎/火

2025-05-08
128期
04
虎/金

43
猪/水

18
鼠/火

45
鸡/木

38
龙/木

26
龙/金

+
13
蛇/水

2025-05-07
127期
45
鸡/木

35
羊/土

08
狗/木

20
狗/土

04
虎/金

22
猴/水

+
49
蛇/土

2025-05-06
126期
05
牛/土

13
蛇/水

10
猴/火

28
虎/土

03
兔/金

31
猪/火

+
02
龙/火

2025-05-05
125期
18
鼠/火

25
蛇/金

19
猪/土

28
虎/土

01
蛇/火

08
狗/木

+
49
蛇/土

2025-05-04
124期
18
鼠/火

41
牛/金

09
鸡/火

14
龙/水

07
猪/木

39
兔/火

+
10
猴/火

2025-05-03
123期
37
蛇/木

30
鼠/水

49
蛇/土

16
虎/木

09
鸡/火

12
马/金

+
45
鸡/木

2025-05-02
122期
07
猪/木

46
猴/木

03
兔/金

02
龙/火

47
羊/火

22
猴/水

+
33
鸡/金

2025-05-01
121期
25
蛇/金

07
猪/木

31
猪/火

34
猴/金

23
羊/木

39
兔/火

+
24
马/木

2025-04-30
120期
18
鼠/火

25
蛇/金

05
牛/土

35
羊/土

31
猪/火

43
猪/水

+
28
虎/土

2025-04-29
119期
21
鸡/水

37
蛇/木

10
猴/火

45
鸡/木

19
猪/土

30
鼠/水

+
38
龙/木

2025-04-28
118期
19
猪/土

15
兔/木

06
鼠/土

39
兔/火

46
猴/木

35
羊/土

+
36
马/土

2025-04-27
117期
33
鸡/金

46
猴/木

40
虎/火

06
鼠/土

22
猴/水

45
鸡/木

+
47
羊/火

2025-04-26
116期
19
猪/土

43
猪/水

35
羊/土

40
虎/火

10
猴/火

48
马/火

+
23
羊/木

2025-04-25
115期
14
龙/水

07
猪/木

09
鸡/火

22
猴/水

10
猴/火

04
虎/金

+
03
兔/金

2025-04-24
114期
06
鼠/土

41
牛/金

05
牛/土

46
猴/木

15
兔/木

09
鸡/火

+
38
龙/木

2025-04-23
113期
02
龙/火

26
龙/金

43
猪/水

38
龙/木

03
兔/金

09
鸡/火

+
46
猴/木

2025-04-22
112期
15
兔/木

43
猪/水

38
龙/木

24
马/木

18
鼠/火

04
虎/金

+
45
鸡/木

2025-04-21
111期
02
龙/火

17
牛/火

13
蛇/水

41
牛/金

28
虎/土

36
马/土

+
45
鸡/木

2025-04-20
110期
15
兔/木

20
狗/土

14
龙/水

46
猴/木

31
猪/火

30
鼠/水

+
47
羊/火

2025-04-19
109期
47
羊/火

16
虎/木

08
狗/木

41
牛/金

06
鼠/土

19
猪/土

+
03
兔/金

2025-04-18
108期
40
虎/火

20
狗/土

39
兔/火

49
蛇/土

08
狗/木

01
蛇/火

+
27
兔/土

2025-04-17
107期
08
狗/木

09
鸡/火

15
兔/木

24
马/木

18
鼠/火

42
鼠/金

+
46
猴/木

2025-04-16
106期
45
鸡/木

20
狗/土

11
羊/金

23
羊/木

34
猴/金

42
鼠/金

+
18
鼠/火

2025-04-15
105期
12
马/金

28
虎/土

48
马/火

37
蛇/木

18
鼠/火

43
猪/水

+
26
龙/金

2025-04-14
104期
09
鸡/火

20
狗/土

33
鸡/金

11
羊/金

32
狗/火

21
鸡/水

+
06
鼠/土

2025-04-13
103期
16
虎/木

28
虎/土

03
兔/金

30
鼠/水

42
鼠/金

49
蛇/土

+
32
狗/火

2025-04-12
102期
24
马/木

40
虎/火

07
猪/木

30
鼠/水

47
羊/火

09
鸡/火

+
38
龙/木

2025-04-11
101期
20
狗/土

49
蛇/土

36
马/土

37
蛇/木

42
鼠/金

30
鼠/水

+
01
蛇/火

2025-04-10
100期
25
蛇/金

03
兔/金

34
猴/金

08
狗/木

31
猪/火

41
牛/金

+
42
鼠/金

2025-04-09
099期
01
蛇/火

34
猴/金

43
猪/水

38
龙/木

06
鼠/土

22
猴/水

+
20
狗/土

2025-04-08
098期
30
鼠/水

39
兔/火

31
猪/火

08
狗/木

21
鸡/水

20
狗/土

+
03
兔/金

2025-04-07
097期
01
蛇/火

32
狗/火

24
马/木

23
羊/木

04
虎/金

02
龙/火

+
31
猪/火

2025-04-06
096期
42
鼠/金

46
猴/木

25
蛇/金

05
牛/土

40
虎/火

22
猴/水

+
34
猴/金

2025-04-05
095期
04
虎/金

43
猪/水

37
蛇/木

40
虎/火

24
马/木

16
虎/木

+
20
狗/土

2025-04-04
094期
35
羊/土

43
猪/水

31
猪/火

37
蛇/木

15
兔/木

39
兔/火

+
33
鸡/金

2025-04-03
093期
16
虎/木

23
羊/木

28
虎/土

21
鸡/水

27
兔/土

46
猴/木

+
10
猴/火

2025-04-02
092期
23
羊/木

24
马/木

36
马/土

03
兔/金

04
虎/金

32
狗/火

+
39
兔/火

2025-04-01
091期
35
羊/土

23
羊/木

32
狗/火

31
猪/火

08
狗/木

24
马/木

+
40
虎/火

2025-03-31
090期
17
牛/火

07
猪/木

23
羊/木

38
龙/木

12
马/金

18
鼠/火

+
35
羊/土

2025-03-30
089期
45
鸡/木

19
猪/土

13
蛇/水

25
蛇/金

15
兔/木

27
兔/土

+
14
龙/水

2025-03-29
088期
14
龙/水

11
羊/金

39
兔/火

10
猴/火

45
鸡/木

33
鸡/金

+
15
兔/木

2025-03-28
087期
30
鼠/水

16
虎/木

14
龙/水

28
虎/土

29
牛/水

03
兔/金

+
15
兔/木

2025-03-27
086期
19
猪/土

29
牛/水

31
猪/火

02
龙/火

42
鼠/金

26
龙/金

+
30
鼠/水

2025-03-26
085期
32
狗/火

31
猪/火

18
鼠/火

14
龙/水

08
狗/木

19
猪/土

+
35
羊/土

2025-03-25
084期
17
牛/火

45
鸡/木

24
马/木

23
羊/木

38
龙/木

40
虎/火

+
20
狗/土

2025-03-24
083期
45
鸡/木

04
虎/金

06
鼠/土

47
羊/火

46
猴/木

11
羊/金

+
28
虎/土

2025-03-23
082期
10
猴/火

35
羊/土

04
虎/金

45
鸡/木

24
马/木

09
鸡/火

+
34
猴/金

2025-03-22
081期
48
马/火

08
狗/木

40
虎/火

09
鸡/火

18
鼠/火

27
兔/土

+
38
龙/木

2025-03-21
080期
27
兔/土

38
龙/木

29
牛/水

02
龙/火

44
狗/水

31
猪/火

+
24
马/木

2025-03-20
079期
04
虎/金

20
狗/土

09
鸡/火

32
狗/火

29
牛/水

44
狗/水

+
10
猴/火

2025-03-19
078期
15
兔/木

38
龙/木

18
鼠/火

03
兔/金

08
狗/木

11
羊/金

+
28
虎/土

2025-03-18
077期
05
牛/土

23
羊/木

27
兔/土

17
牛/火

11
羊/金

39
兔/火

+
22
猴/水

2025-03-17
076期
28
虎/土

02
龙/火

14
龙/水

10
猴/火

16
虎/木

23
羊/木

+
39
兔/火

2025-03-16
075期
30
鼠/水

05
牛/土

10
猴/火

37
蛇/木

32
狗/火

07
猪/木

+
09
鸡/火

2025-03-15
074期
22
猴/水

21
鸡/水

01
蛇/火

47
羊/火

29
牛/水

11
羊/金

+
35
羊/土

2025-03-14
073期
43
猪/水

22
猴/水

48
马/火

23
羊/木

33
鸡/金

10
猴/火

+
03
兔/金

2025-03-13
072期
35
羊/土

37
蛇/木

48
马/火

33
鸡/金

14
龙/水

22
猴/水

+
40
虎/火

2025-03-12
071期
32
狗/火

09
鸡/火

44
狗/水

36
马/土

23
羊/木

40
虎/火

+
49
蛇/土

2025-03-11
070期
16
虎/木

35
羊/土

46
猴/木

25
蛇/金

19
猪/土

18
鼠/火

+
43
猪/水

2025-03-10
069期
44
狗/水

30
鼠/水

05
牛/土

40
虎/火

06
鼠/土

15
兔/木

+
29
牛/水

2025-03-09
068期
42
鼠/金

33
鸡/金

47
羊/火

40
虎/火

30
鼠/水

02
龙/火

+
44
狗/水

2025-03-08
067期
15
兔/木

35
羊/土

39
兔/火

48
马/火

45
鸡/木

11
羊/金

+
44
狗/水

2025-03-07
066期
49
蛇/土

45
鸡/木

27
兔/土

22
猴/水

13
蛇/水

26
龙/金

+
12
马/金

2025-03-06
065期
30
鼠/水

41
牛/金

38
龙/木

25
蛇/金

35
羊/土

16
虎/木

+
48
马/火

2025-03-05
064期
48
马/火

40
虎/火

03
兔/金

33
鸡/金

47
羊/火

04
虎/金

+
31
猪/火

2025-03-04
063期
42
鼠/金

05
牛/土

38
龙/木

03
兔/金

49
蛇/土

21
鸡/水

+
23
羊/木

2025-03-03
062期
27
兔/土

37
蛇/木

10
猴/火

26
龙/金

02
龙/火

48
马/火

+
35
羊/土

2025-03-02
061期
42
鼠/金

28
虎/土

39
兔/火

06
鼠/土

23
羊/木

35
羊/土

+
10
猴/火

2025-03-01
060期
10
猴/火

08
狗/木

17
牛/火

13
蛇/水

47
羊/火

44
狗/水

+
11
羊/金

2025-02-28
059期
40
虎/火

16
虎/木

17
牛/火

26
龙/金

36
马/土

04
虎/金

+
24
马/木

2025-02-27
058期
22
猴/水

23
羊/木

33
鸡/金

34
猴/金

49
蛇/土

19
猪/土

+
31
猪/火

2025-02-26
057期
10
猴/火

11
羊/金

13
蛇/水

01
蛇/火

40
虎/火

22
猴/水

+
20
狗/土

2025-02-25
056期
41
牛/金

08
狗/木

33
鸡/金

30
鼠/水

43
猪/水

07
猪/木

+
42
鼠/金

2025-02-24
055期
47
羊/火

36
马/土

40
虎/火

43
猪/水

11
羊/金

37
蛇/木

+
44
狗/水

2025-02-23
054期
23
羊/木

28
虎/土

30
鼠/水

35
羊/土

19
猪/土

27
兔/土

+
25
蛇/金

2025-02-22
053期
33
鸡/金

48
马/火

05
牛/土

19
猪/土

13
蛇/水

17
牛/火

+
11
羊/金

2025-02-21
052期
07
猪/木

06
鼠/土

17
牛/火

13
蛇/水

34
猴/金

31
猪/火

+
10
猴/火

2025-02-20
051期
27
兔/土

22
猴/水

31
猪/火

07
猪/木

13
蛇/水

18
鼠/火

+
49
蛇/土

2025-02-19
050期
29
牛/水

21
鸡/水

46
猴/木

48
马/火

15
兔/木

45
鸡/木

+
05
牛/土

2025-02-18
049期
49
蛇/土

05
牛/土

01
蛇/火

17
牛/火

31
猪/火

06
鼠/土

+
43
猪/水

2025-02-17
048期
07
猪/木

35
羊/土

23
羊/木

33
鸡/金

46
猴/木

27
兔/土

+
18
鼠/火

2025-02-16
047期
14
龙/水

22
猴/水

13
蛇/水

31
猪/火

20
狗/土

16
虎/木

+
12
马/金

2025-02-15
046期
41
牛/金

01
蛇/火

24
马/木

34
猴/金

33
鸡/金

30
鼠/水

+
12
马/金

2025-02-14
045期
40
虎/火

28
虎/土

03
兔/金

48
马/火

31
猪/火

08
狗/木

+
30
鼠/水

2025-02-13
044期
24
马/木

28
虎/土

46
猴/木

34
猴/金

14
龙/水

43
猪/水

+
07
猪/木

2025-02-12
043期
04
虎/金

27
兔/土

38
龙/木

40
虎/火

19
猪/土

35
羊/土

+
37
蛇/木

2025-02-11
042期
44
狗/水

13
蛇/水

39
兔/火

22
猴/水

46
猴/木

47
羊/火

+
42
鼠/金

2025-02-10
041期
48
马/火

35
羊/土

22
猴/水

30
鼠/水

26
龙/金

04
虎/金

+
28
虎/土

2025-02-09
040期
01
蛇/火

32
狗/火

35
羊/土

30
鼠/水

08
狗/木

16
虎/木

+
20
狗/土

2025-02-08
039期
41
牛/金

48
马/火

10
猴/火

17
牛/火

34
猴/金

43
猪/水

+
40
虎/火

2025-02-07
038期
11
羊/金

01
蛇/火

47
羊/火

39
兔/火

12
马/金

03
兔/金

+
20
狗/土

2025-02-06
037期
35
羊/土

32
狗/火

46
猴/木

08
狗/木

37
蛇/木

16
虎/木

+
25
蛇/金

2025-02-05
036期
38
龙/木

07
猪/木

19
猪/土

47
羊/火

10
猴/火

40
虎/火

+
29
牛/水

2025-02-04
035期
27
兔/土

35
羊/土

32
狗/火

37
蛇/木

06
鼠/土

18
鼠/火

+
21
鸡/水

2025-02-03
034期
01
蛇/火

04
虎/金

21
鸡/水

40
虎/火

16
虎/木

49
蛇/土

+
23
羊/木

2025-02-02
033期
41
牛/金

22
猴/水

19
猪/土

40
虎/火

46
猴/木

39
兔/火

+
48
马/火

2025-02-01
032期
22
猴/水

15
兔/木

13
蛇/水

02
龙/火

17
牛/火

33
鸡/金

+
39
兔/火

2025-01-31
031期
30
鼠/水

23
羊/木

08
狗/木

24
马/木

33
鸡/金

25
蛇/金

+
22
猴/水

2025-01-30
030期
27
兔/土

39
兔/火

23
羊/木

45
鸡/木

44
狗/水

46
猴/木

+
25
蛇/金

2025-01-29
029期
14
龙/水

46
猴/木

03
兔/金

35
羊/土

43
猪/水

10
猴/火

+
13
蛇/水

2025-01-28
028期
34
羊/土

14
兔/木

29
鼠/水

33
猴/金

05
鼠/土

28
牛/水

+
40
牛/金

2025-01-27
027期
02
兔/金

06
猪/木

28
牛/水

32
鸡/金

45
猴/木

16
牛/火

+
25
龙/金

2025-01-26
026期
36
蛇/木

25
龙/金

07
狗/木

02
兔/金

34
羊/土

09
猴/火

+
37
龙/木

2025-01-25
025期
17
鼠/火

42
猪/水

28
牛/水

44
鸡/木

05
鼠/土

20
鸡/水

+
30
猪/火

2025-01-24
024期
03
虎/金

45
猴/木

18
猪/土

40
牛/金

28
牛/水

02
兔/金

+
41
鼠/金

2025-01-23
023期
15
虎/木

43
狗/水

06
猪/木

30
猪/火

16
牛/火

09
猴/火

+
45
猴/木

2025-01-22
022期
27
虎/土

23
马/木

26
兔/土

14
兔/木

16
牛/火

18
猪/土

+
04
牛/土

2025-01-21
021期
39
虎/火

19
狗/土

24
蛇/金

31
狗/火

32
鸡/金

30
猪/火

+
14
兔/木

2025-01-20
020期
44
鸡/木

04
牛/土

47
马/火

01
龙/火

49
龙/土

14
兔/木

+
34
羊/土

2025-01-19
019期
03
虎/金

23
马/木

49
龙/土

13
龙/水

39
虎/火

26
兔/土

+
06
猪/木

2025-01-18
018期
12
蛇/水

01
龙/火

24
蛇/金

33
猴/金

21
猴/水

44
鸡/木

+
10
羊/金

2025-01-17
017期
42
猪/水

29
鼠/水

20
鸡/水

49
龙/土

22
羊/木

06
猪/木

+
38
兔/火

2025-01-16
016期
40
牛/金

22
羊/木

27
虎/土

42
猪/水

43
狗/水

39
虎/火

+
21
猴/水

2025-01-15
015期
13
龙/水

37
龙/木

02
兔/金

03
虎/金

43
狗/水

12
蛇/水

+
36
蛇/木

2025-01-14
014期
48
蛇/土

20
鸡/水

30
猪/火

39
虎/火

41
鼠/金

06
猪/木

+
27
虎/土

2025-01-13
013期
42
猪/水

43
狗/水

36
蛇/木

11
马/金

25
龙/金

47
马/火

+
07
狗/木

2025-01-12
012期
24
蛇/金

32
鸡/金

10
羊/金

15
虎/木

37
龙/木

04
牛/土

+
39
虎/火

2025-01-11
011期
07
狗/木

45
猴/木

03
虎/金

30
猪/火

01
龙/火

10
羊/金

+
06
猪/木

2025-01-10
010期
37
龙/木

18
猪/土

17
鼠/火

47
马/火

21
猴/水

23
马/木

+
25
龙/金

2025-01-09
009期
23
马/木

17
鼠/火

43
狗/水

01
龙/火

10
羊/金

13
龙/水

+
30
猪/火

2025-01-08
008期
13
龙/水

24
蛇/金

48
蛇/土

23
马/木

32
鸡/金

20
鸡/水

+
46
羊/火

2025-01-07
007期
32
鸡/金

12
蛇/水

48
蛇/土

45
猴/木

39
虎/火

07
狗/木

+
15
虎/木

2025-01-06
006期
03
虎/金

13
龙/水

12
蛇/水

28
牛/水

01
龙/火

18
猪/土

+
04
牛/土

2025-01-05
005期
35
马/土

21
猴/水

10
羊/金

03
虎/金

32
鸡/金

40
牛/金

+
08
鸡/火

2025-01-04
004期
45
猴/木

16
牛/火

17
鼠/火

07
狗/木

37
龙/木

28
牛/水

+
33
猴/金

2025-01-03
003期
28
牛/水

01
龙/火

16
牛/火

47
马/火

18
猪/土

42
猪/水

+
33
猴/金

2025-01-02
002期
13
龙/水

04
牛/土

10
羊/金

06
猪/木

05
鼠/土

28
牛/水

+
37
龙/木

2025-01-01
001期
25
龙/金

18
猪/土

06
猪/木

14
兔/木

29
鼠/水

39
虎/火

+
22
羊/木

`;