// 初始数据
const fagD = `



2026-08-06
085期
42
牛/金

24
羊/木

29
虎/土

48
羊/火

13
马/金

30
牛/水

+
03
龙/火

2026-08-04
084期
31
鼠/水

16
兔/木

04
兔/金

11
猴/火

13
马/金

33
狗/火

+
38
蛇/木

2026-08-01
083期
37
马/土

07
鼠/土

16
兔/木

01
马/水

32
猪/火

22
鸡/水

+
23
猴/水

2026-07-30
082期
14
蛇/水

17
虎/木

01
马/水

02
蛇/火

35
猴/金

23
猴/水

+
48
羊/火

2026-07-28
081期
30
牛/水

21
狗/土

20
猪/土

07
鼠/土

04
兔/金

14
蛇/水

+
34
鸡/金

2026-07-25
080期
12
羊/金

26
蛇/金

07
鼠/土

05
虎/金

31
鼠/水

42
牛/金

+
11
猴/火

2026-07-23
079期
04
兔/金

32
猪/火

07
鼠/土

15
龙/水

46
鸡/木

29
虎/土

+
23
猴/水

2026-07-21
078期
06
牛/土

47
猴/木

45
狗/水

01
马/水

41
虎/火

37
马/土

+
08
猪/木

2026-07-16
077期
18
牛/火

30
牛/水

26
蛇/金

21
狗/土

44
猪/水

32
猪/火

+
27
龙/金

2026-07-14
076期
31
鼠/水

44
猪/水

27
龙/金

10
鸡/火

16
兔/木

19
鼠/火

+
17
虎/木

2026-07-11
075期
05
虎/金

02
蛇/火

07
鼠/土

11
猴/火

41
虎/火

46
鸡/木

+
43
鼠/金

2026-07-09
074期
21
狗/土

07
鼠/土

38
蛇/木

18
牛/火

01
马/水

33
狗/火

+
28
兔/土

2026-07-07
073期
37
马/土

48
羊/火

34
鸡/金

49
马/火

05
虎/金

43
鼠/金

+
27
龙/金

2026-07-05
072期
14
蛇/水

03
龙/火

19
鼠/火

38
蛇/木

20
猪/土

31
鼠/水

+
44
猪/水

2026-07-02
071期
34
鸡/金

46
鸡/木

17
虎/木

05
虎/金

31
鼠/水

26
蛇/金

+
43
鼠/金

2026-06-30
070期
18
牛/火

12
羊/金

22
鸡/水

14
蛇/水

17
虎/木

40
兔/火

+
13
马/金

2026-06-28
069期
37
马/土

32
猪/火

07
鼠/土

26
蛇/金

05
虎/金

40
兔/火

+
35
猴/金

2026-06-25
068期
28
兔/土

12
羊/金

20
猪/土

30
牛/水

16
兔/木

19
鼠/火

+
29
虎/土

2026-06-23
067期
39
龙/木

41
虎/火

15
龙/水

34
鸡/金

25
马/木

02
蛇/火

+
10
鸡/火

2026-06-20
066期
16
兔/木

10
鸡/火

07
鼠/土

41
虎/火

15
龙/水

05
虎/金

+
46
鸡/木

2026-06-18
065期
26
蛇/金

20
猪/土

47
猴/木

31
鼠/水

34
鸡/金

06
牛/土

+
24
羊/木

2026-06-14
064期
32
猪/火

10
鸡/火

29
虎/土

17
虎/木

12
羊/金

35
猴/金

+
01
马/水

2026-06-11
063期
06
牛/土

29
虎/土

28
兔/土

10
鸡/火

03
龙/火

09
狗/木

+
27
龙/金

2026-06-09
062期
40
兔/火

08
猪/木

11
猴/火

26
蛇/金

14
蛇/水

33
狗/火

+
30
牛/水

2026-06-06
061期
19
鼠/火

34
鸡/金

05
虎/金

20
猪/土

12
羊/金

36
羊/土

+
46
鸡/木

2026-06-04
060期
04
兔/金

43
鼠/金

47
猴/木

15
龙/水

07
鼠/土

37
马/土

+
44
猪/水

2026-06-02
059期
14
蛇/水

16
兔/木

45
狗/水

09
狗/木

35
猴/金

37
马/土

+
20
猪/土

2026-05-30
058期
39
龙/木

40
兔/火

21
狗/土

01
马/水

12
羊/金

41
虎/火

+
42
牛/金

2026-05-28
057期
35
猴/金

07
鼠/土

13
马/金

40
兔/火

25
马/木

43
鼠/金

+
47
猴/木

2026-05-26
056期
32
猪/火

34
鸡/金

10
鸡/火

47
猴/木

18
牛/火

11
猴/火

+
33
狗/火

2026-05-23
055期
20
猪/土

07
鼠/土

02
蛇/火

42
牛/金

49
马/火

47
猴/木

+
08
猪/木

2026-05-21
054期
07
鼠/土

13
马/金

15
龙/水

05
虎/金

31
鼠/水

27
龙/金

+
16
兔/木

2026-05-19
053期
02
蛇/火

21
狗/土

27
龙/金

01
马/水

20
猪/土

04
兔/金

+
19
鼠/火

2026-05-16
052期
25
马/木

43
鼠/金

41
虎/火

28
兔/土

11
猴/火

36
羊/土

+
22
鸡/水

2026-05-14
051期
47
猴/木

27
龙/金

23
猴/水

34
鸡/金

30
牛/水

45
狗/水

+
28
兔/土

2026-05-12
050期
04
兔/金

22
鸡/水

16
兔/木

47
猴/木

25
马/木

19
鼠/火

+
40
兔/火

2026-05-10
049期
17
虎/木

41
虎/火

26
蛇/金

47
猴/木

09
狗/木

42
牛/金

+
08
猪/木

2026-05-07
048期
23
猴/水

34
鸡/金

28
兔/土

20
猪/土

14
蛇/水

06
牛/土

+
49
马/火

2026-05-05
047期
47
猴/木

10
鸡/火

07
鼠/土

02
蛇/火

18
牛/火

08
猪/木

+
04
兔/金

2026-05-02
046期
08
猪/木

28
兔/土

48
羊/火

30
牛/水

03
龙/火

02
蛇/火

+
09
狗/木

2026-04-25
045期
21
狗/土

42
牛/金

46
鸡/木

36
羊/土

04
兔/金

16
兔/木

+
09
狗/木

2026-04-23
044期
12
羊/金

38
蛇/木

45
狗/水

23
猴/水

48
羊/火

37
马/土

+
08
猪/木

2026-04-21
043期
04
兔/金

11
猴/火

44
猪/水

10
鸡/火

02
蛇/火

26
蛇/金

+
40
兔/火

2026-04-18
042期
17
虎/木

39
龙/木

20
猪/土

46
鸡/木

27
龙/金

32
猪/火

+
34
鸡/金

2026-04-16
041期
06
牛/土

28
兔/土

44
猪/水

46
鸡/木

14
蛇/水

12
羊/金

+
15
龙/水

2026-04-14
040期
19
鼠/火

44
猪/水

08
猪/木

46
鸡/木

33
狗/火

22
鸡/水

+
18
牛/火

2026-04-11
039期
14
蛇/水

42
牛/金

40
兔/火

11
猴/火

17
虎/木

28
兔/土

+
02
蛇/火

2026-04-09
038期
24
羊/木

43
鼠/金

45
狗/水

44
猪/水

13
马/金

16
兔/木

+
40
兔/火

2026-04-07
037期
33
狗/火

23
猴/水

25
马/木

34
鸡/金

29
虎/土

08
猪/木

+
49
马/火

2026-04-04
036期
32
猪/火

45
狗/水

40
兔/火

20
猪/土

35
猴/金

28
兔/土

+
43
鼠/金

2026-03-31
035期
20
猪/土

32
猪/火

28
兔/土

09
狗/木

19
鼠/火

18
牛/火

+
44
猪/水

2026-03-28
034期
42
牛/金

26
蛇/金

27
龙/金

11
猴/火

21
狗/土

45
狗/水

+
19
鼠/火

2026-03-26
033期
27
龙/金

12
羊/金

23
猴/水

28
兔/土

37
马/土

17
虎/木

+
03
龙/火

2026-03-24
032期
26
蛇/金

06
牛/土

22
鸡/水

44
猪/水

49
马/火

09
狗/木

+
07
鼠/土

2026-03-21
031期
09
狗/木

47
猴/木

18
牛/火

11
猴/火

05
虎/金

23
猴/水

+
24
羊/木

2026-03-19
030期
06
牛/土

08
猪/木

45
狗/水

02
蛇/火

41
虎/火

33
狗/火

+
48
羊/火

2026-03-17
029期
22
鸡/水

18
牛/火

45
狗/水

16
兔/木

28
兔/土

49
马/火

+
13
马/金

2026-03-12
028期
07
鼠/土

14
蛇/水

26
蛇/金

13
马/金

16
兔/木

30
牛/水

+
34
鸡/金

2026-03-10
027期
34
鸡/金

16
兔/木

25
马/木

02
蛇/火

35
猴/金

37
马/土

+
49
马/火

2026-03-07
026期
18
牛/火

12
羊/金

22
鸡/水

28
兔/土

15
龙/水

37
马/土

+
31
鼠/水

2026-03-05
025期
04
兔/金

31
鼠/水

24
羊/木

18
牛/火

46
鸡/木

42
牛/金

+
11
猴/火

2026-03-03
024期
20
猪/土

32
猪/火

31
鼠/水

44
猪/水

13
马/金

06
牛/土

+
45
狗/水

2026-02-28
023期
47
猴/木

37
马/土

15
龙/水

46
鸡/木

39
龙/木

05
虎/金

+
29
虎/土

2026-02-26
022期
06
牛/土

19
鼠/火

38
蛇/木

15
龙/水

42
牛/金

13
马/金

+
34
鸡/金

2026-02-24
021期
10
鸡/火

04
兔/金

03
龙/火

02
蛇/火

23
猴/水

13
马/金

+
12
羊/金

2026-02-21
020期
34
鸡/金

18
牛/火

35
猴/金

37
马/土

49
马/火

02
蛇/火

+
33
狗/火

2026-02-15
019期
08
狗/木

28
虎/土

46
猴/木

37
蛇/木

36
马/土

33
鸡/金

+
04
虎/金

2026-02-12
018期
03
兔/金

46
猴/木

37
蛇/木

25
蛇/金

02
龙/火

14
龙/水

+
10
猴/火

2026-02-10
017期
39
兔/火

04
虎/金

26
龙/金

03
兔/金

18
鼠/火

14
龙/水

+
40
虎/火

2026-02-07
016期
32
狗/火

12
马/金

37
蛇/木

22
猴/水

44
狗/水

28
虎/土

+
20
狗/土

2026-02-05
015期
35
羊/土

24
马/木

36
马/土

09
鸡/火

01
蛇/火

17
牛/火

+
42
鼠/金

2026-02-03
014期
42
鼠/金

39
兔/火

23
羊/木

27
兔/土

12
马/金

37
蛇/木

+
05
牛/土

2026-01-31
013期
30
鼠/水

35
羊/土

32
狗/火

36
马/土

25
蛇/金

47
羊/火

+
46
猴/木

2026-01-29
012期
14
龙/水

44
狗/水

09
鸡/火

06
鼠/土

35
羊/土

12
马/金

+
11
羊/金

2026-01-27
011期
38
龙/木

47
羊/火

25
蛇/金

12
马/金

14
龙/水

07
猪/木

+
15
兔/木

2026-01-24
010期
16
虎/木

17
牛/火

48
马/火

22
猴/水

28
虎/土

06
鼠/土

+
45
鸡/木

2026-01-22
009期
31
猪/火

04
虎/金

24
马/木

27
兔/土

15
兔/木

09
鸡/火

+
45
鸡/木

2026-01-20
008期
06
鼠/土

46
猴/木

44
狗/水

09
鸡/火

01
蛇/火

04
虎/金

+
27
兔/土

2026-01-17
007期
27
兔/土

12
马/金

42
鼠/金

05
牛/土

23
羊/木

15
兔/木

+
46
猴/木

2026-01-15
006期
44
狗/水

06
鼠/土

37
蛇/木

03
兔/金

38
龙/木

39
兔/火

+
48
马/火

2026-01-13
005期
38
龙/木

48
马/火

14
龙/水

49
蛇/土

24
马/木

34
猴/金

+
27
兔/土

2026-01-10
004期
37
蛇/木

20
狗/土

22
猴/水

24
马/木

16
虎/木

03
兔/金

+
42
鼠/金

2026-01-08
003期
45
鸡/木

15
兔/木

46
猴/木

21
鸡/水

24
马/木

40
虎/火

+
13
蛇/水

2026-01-06
002期
12
马/金

02
龙/火

08
狗/木

19
猪/土

28
虎/土

36
马/土

+
01
蛇/火

2026-01-03
001期
20
狗/土

16
虎/木

02
龙/火

21
鸡/水

13
蛇/水

10
猴/火

+
14
龙/水

2025-12-28
134期
07
猪/木

30
鼠/水

19
猪/土

11
羊/金

25
蛇/金

10
猴/火

+
45
鸡/木

2025-12-25
133期
01
蛇/火

30
鼠/水

41
牛/金

02
龙/火

04
虎/金

43
猪/水

+
13
蛇/水

2025-12-21
132期
34
猴/金

47
羊/火

39
兔/火

09
鸡/火

17
牛/火

27
兔/土

+
46
猴/木

2025-12-18
131期
23
羊/木

28
虎/土

34
猴/金

31
猪/火

33
鸡/金

06
鼠/土

+
11
羊/金

2025-12-16
130期
38
龙/木

23
羊/木

03
兔/金

28
虎/土

12
马/金

35
羊/土

+
24
马/木

2025-12-13
129期
49
蛇/土

19
猪/土

28
虎/土

10
猴/火

17
牛/火

45
鸡/木

+
01
蛇/火

2025-12-11
128期
01
蛇/火

30
鼠/水

25
蛇/金

42
鼠/金

06
鼠/土

05
牛/土

+
43
猪/水

2025-12-06
127期
06
鼠/土

40
虎/火

04
虎/金

34
猴/金

26
龙/金

28
虎/土

+
25
蛇/金

2025-12-02
126期
18
鼠/火

37
蛇/木

38
龙/木

34
猴/金

06
鼠/土

29
牛/水

+
39
兔/火

2025-11-25
125期
17
牛/火

01
蛇/火

48
马/火

02
龙/火

37
蛇/木

35
羊/土

+
08
狗/木

2025-11-20
124期
36
马/土

39
兔/火

26
龙/金

35
羊/土

33
鸡/金

19
猪/土

+
05
牛/土

2025-11-18
123期
04
虎/金

28
虎/土

10
猴/火

36
马/土

02
龙/火

26
龙/金

+
23
羊/木

2025-11-16
122期
47
羊/火

28
虎/土

38
龙/木

02
龙/火

11
羊/金

13
蛇/水

+
07
猪/木

2025-11-13
121期
28
虎/土

11
羊/金

37
蛇/木

10
猴/火

39
兔/火

30
鼠/水

+
15
兔/木

2025-11-11
120期
37
蛇/木

28
虎/土

20
狗/土

40
虎/火

38
龙/木

18
鼠/火

+
41
牛/金

2025-11-08
119期
16
虎/木

17
牛/火

09
鸡/火

46
猴/木

07
猪/木

33
鸡/金

+
49
蛇/土

2025-11-06
118期
41
牛/金

10
猴/火

17
牛/火

33
鸡/金

22
猴/水

40
虎/火

+
31
猪/火

2025-11-04
117期
19
猪/土

26
龙/金

39
兔/火

28
虎/土

20
狗/土

44
狗/水

+
04
虎/金

2025-10-28
116期
45
鸡/木

07
猪/木

15
兔/木

04
虎/金

46
猴/木

21
鸡/水

+
24
马/木

2025-10-25
115期
39
兔/火

43
猪/水

06
鼠/土

07
猪/木

27
兔/土

36
马/土

+
01
蛇/火

2025-10-23
114期
19
猪/土

04
虎/金

26
龙/金

46
猴/木

24
马/木

25
蛇/金

+
39
兔/火

2025-10-21
113期
11
羊/金

08
狗/木

01
蛇/火

09
鸡/火

32
狗/火

18
鼠/火

+
13
蛇/水

2025-10-18
112期
13
蛇/水

18
鼠/火

31
猪/火

05
牛/土

44
狗/水

17
牛/火

+
02
龙/火

2025-10-16
111期
40
虎/火

43
猪/水

11
羊/金

32
狗/火

02
龙/火

48
马/火

+
12
马/金

2025-10-14
110期
17
牛/火

24
马/木

03
兔/金

15
兔/木

44
狗/水

32
狗/火

+
20
狗/土

2025-10-11
109期
19
猪/土

05
牛/土

39
兔/火

30
鼠/水

06
鼠/土

18
鼠/火

+
07
猪/木

2025-10-09
108期
45
鸡/木

01
蛇/火

39
兔/火

03
兔/金

31
猪/火

24
马/木

+
07
猪/木

2025-10-06
107期
24
马/木

17
牛/火

34
猴/金

15
兔/木

19
猪/土

23
羊/木

+
33
鸡/金

2025-09-30
106期
46
猴/木

13
蛇/水

21
鸡/水

41
牛/金

33
鸡/金

44
狗/水

+
43
猪/水

2025-09-27
105期
18
鼠/火

48
马/火

26
龙/金

08
狗/木

16
虎/木

14
龙/水

+
44
狗/水

2025-09-25
104期
11
羊/金

02
龙/火

22
猴/水

47
羊/火

27
兔/土

46
猴/木

+
32
狗/火

2025-09-20
103期
17
牛/火

08
狗/木

43
猪/水

36
马/土

13
蛇/水

24
马/木

+
41
牛/金

2025-09-18
102期
22
猴/水

37
蛇/木

35
羊/土

33
鸡/金

48
马/火

36
马/土

+
30
鼠/水

2025-09-16
101期
21
鸡/水

33
鸡/金

32
狗/火

22
猴/水

28
虎/土

14
龙/水

+
25
蛇/金

2025-09-13
100期
47
羊/火

37
蛇/木

23
羊/木

15
兔/木

21
鸡/水

49
蛇/土

+
30
鼠/水

2025-09-11
099期
44
狗/水

21
鸡/水

25
蛇/金

32
狗/火

22
猴/水

11
羊/金

+
38
龙/木

2025-09-09
098期
44
狗/水

32
狗/火

40
虎/火

15
兔/木

42
鼠/金

07
猪/木

+
09
鸡/火

2025-09-06
097期
43
猪/水

19
猪/土

06
鼠/土

22
猴/水

23
羊/木

34
猴/金

+
11
羊/金

2025-09-02
096期
05
牛/土

18
鼠/火

29
牛/水

49
蛇/土

23
羊/木

24
马/木

+
11
羊/金

2025-08-30
095期
31
猪/火

06
鼠/土

33
鸡/金

44
狗/水

49
蛇/土

18
鼠/火

+
02
龙/火

2025-08-28
094期
49
蛇/土

44
狗/水

05
牛/土

36
马/土

48
马/火

39
兔/火

+
32
狗/火

2025-08-26
093期
38
龙/木

16
虎/木

02
龙/火

25
蛇/金

48
马/火

03
兔/金

+
06
鼠/土

2025-08-23
092期
17
牛/火

45
鸡/木

22
猴/水

39
兔/火

36
马/土

26
龙/金

+
14
龙/水

2025-08-21
091期
10
猴/火

45
鸡/木

06
鼠/土

32
狗/火

23
羊/木

08
狗/木

+
03
兔/金

2025-08-19
090期
28
虎/土

49
蛇/土

32
狗/火

34
猴/金

37
蛇/木

45
鸡/木

+
07
猪/木

2025-08-16
089期
38
龙/木

10
猴/火

04
虎/金

32
狗/火

15
兔/木

20
狗/土

+
26
龙/金

2025-08-14
088期
13
蛇/水

27
兔/土

31
猪/火

34
猴/金

25
蛇/金

01
蛇/火

+
33
鸡/金

2025-08-12
087期
18
鼠/火

08
狗/木

16
虎/木

32
狗/火

28
虎/土

29
牛/水

+
20
狗/土

2025-08-09
086期
36
马/土

45
鸡/木

48
马/火

49
蛇/土

25
蛇/金

44
狗/水

+
13
蛇/水

2025-08-07
085期
07
猪/木

03
兔/金

25
蛇/金

29
牛/水

39
兔/火

37
蛇/木

+
08
狗/木

2025-08-02
084期
44
狗/水

34
猴/金

10
猴/火

14
龙/水

21
鸡/水

18
鼠/火

+
24
马/木

2025-07-31
083期
35
羊/土

23
羊/木

27
兔/土

47
羊/火

21
鸡/水

10
猴/火

+
39
兔/火

2025-07-29
082期
28
虎/土

17
牛/火

35
羊/土

09
鸡/火

11
羊/金

43
猪/水

+
42
鼠/金

2025-07-26
081期
25
蛇/金

19
猪/土

45
鸡/木

22
猴/水

32
狗/火

33
鸡/金

+
36
马/土

2025-07-21
080期
35
羊/土

17
牛/火

48
马/火

31
猪/火

28
虎/土

20
狗/土

+
32
狗/火

2025-07-19
079期
48
马/火

25
蛇/金

49
蛇/土

29
牛/水

40
虎/火

06
鼠/土

+
42
鼠/金

2025-07-17
078期
45
鸡/木

19
猪/土

31
猪/火

37
蛇/木

12
马/金

42
鼠/金

+
15
兔/木

2025-07-15
077期
09
鸡/火

44
狗/水

23
羊/木

30
鼠/水

12
马/金

31
猪/火

+
05
牛/土

2025-07-12
076期
24
马/木

27
兔/土

35
羊/土

20
狗/土

05
牛/土

17
牛/火

+
38
龙/木

2025-07-10
075期
06
鼠/土

13
蛇/水

39
兔/火

25
蛇/金

32
狗/火

23
羊/木

+
34
猴/金

2025-07-08
074期
22
猴/水

16
虎/木

13
蛇/水

23
羊/木

17
牛/火

35
羊/土

+
41
牛/金

2025-07-06
073期
47
羊/火

09
鸡/火

33
鸡/金

05
牛/土

22
猴/水

46
猴/木

+
36
马/土

2025-07-03
072期
45
鸡/木

24
马/木

35
羊/土

07
猪/木

37
蛇/木

17
牛/火

+
30
鼠/水

2025-06-29
071期
34
猴/金

42
鼠/金

32
狗/火

29
牛/水

46
猴/木

19
猪/土

+
20
狗/土

2025-06-26
070期
09
鸡/火

29
牛/水

49
蛇/土

24
马/木

11
羊/金

23
羊/木

+
30
鼠/水

2025-06-24
069期
03
兔/金

21
鸡/水

33
鸡/金

45
鸡/木

49
蛇/土

28
虎/土

+
29
牛/水

2025-06-21
068期
02
龙/火

39
兔/火

27
兔/土

31
猪/火

04
虎/金

19
猪/土

+
13
蛇/水

2025-06-19
067期
12
马/金

35
羊/土

18
鼠/火

13
蛇/水

07
猪/木

34
猴/金

+
06
鼠/土

2025-06-17
066期
40
虎/火

05
牛/土

19
猪/土

45
鸡/木

30
鼠/水

44
狗/水

+
26
龙/金

2025-06-12
065期
32
狗/火

25
蛇/金

06
鼠/土

39
兔/火

36
马/土

45
鸡/木

+
13
蛇/水

2025-06-10
064期
45
鸡/木

09
鸡/火

46
猴/木

35
羊/土

40
虎/火

13
蛇/水

+
26
龙/金

2025-06-07
063期
09
鸡/火

15
兔/木

27
兔/土

39
兔/火

34
猴/金

30
鼠/水

+
19
猪/土

2025-06-05
062期
39
兔/火

22
猴/水

18
鼠/火

33
鸡/金

24
马/木

44
狗/水

+
03
兔/金

2025-06-03
061期
01
蛇/火

15
兔/木

02
龙/火

13
蛇/水

41
牛/金

46
猴/木

+
27
兔/土

2025-06-01
060期
29
牛/水

28
虎/土

16
虎/木

38
龙/木

47
羊/火

12
马/金

+
26
龙/金

2025-05-29
059期
35
羊/土

24
马/木

21
鸡/水

05
牛/土

06
鼠/土

16
虎/木

+
33
鸡/金

2025-05-24
058期
47
羊/火

15
兔/木

45
鸡/木

06
鼠/土

19
猪/土

14
龙/水

+
17
牛/火

2025-05-22
057期
04
虎/金

34
猴/金

29
牛/水

11
羊/金

26
龙/金

35
羊/土

+
18
鼠/火

2025-05-20
056期
10
猴/火

40
虎/火

31
猪/火

28
虎/土

15
兔/木

34
猴/金

+
48
马/火

2025-05-17
055期
27
兔/土

22
猴/水

12
马/金

29
牛/水

32
狗/火

34
猴/金

+
09
鸡/火

2025-05-15
054期
29
牛/水

12
马/金

32
狗/火

46
猴/木

34
猴/金

06
鼠/土

+
16
虎/木

2025-05-13
053期
49
蛇/土

41
牛/金

45
鸡/木

13
蛇/水

26
龙/金

27
兔/土

+
46
猴/木

2025-05-11
052期
49
蛇/土

19
猪/土

28
虎/土

26
龙/金

46
猴/木

29
牛/水

+
32
狗/火

2025-05-08
051期
43
猪/水

17
牛/火

27
兔/土

11
羊/金

22
猴/水

06
鼠/土

+
24
马/木

2025-05-06
050期
29
牛/水

25
蛇/金

26
龙/金

15
兔/木

41
牛/金

12
马/金

+
42
鼠/金

2025-05-03
049期
49
蛇/土

20
狗/土

30
鼠/水

18
鼠/火

35
羊/土

47
羊/火

+
44
狗/水

2025-05-01
048期
32
狗/火

47
羊/火

21
鸡/水

41
牛/金

07
猪/木

04
虎/金

+
28
虎/土

2025-04-29
047期
30
鼠/水

24
马/木

20
狗/土

21
鸡/水

32
狗/火

38
龙/木

+
47
羊/火

2025-04-26
046期
18
鼠/火

15
兔/木

21
鸡/水

11
羊/金

40
虎/火

29
牛/水

+
08
狗/木

2025-04-24
045期
12
马/金

48
马/火

16
虎/木

44
狗/水

35
羊/土

21
鸡/水

+
32
狗/火

2025-04-22
044期
11
羊/金

27
兔/土

23
羊/木

03
兔/金

20
狗/土

07
猪/木

+
29
牛/水

2025-04-19
043期
01
蛇/火

37
蛇/木

24
马/木

49
蛇/土

45
鸡/木

11
羊/金

+
22
猴/水

2025-04-15
042期
21
鸡/水

42
鼠/金

20
狗/土

10
猴/火

22
猴/水

23
羊/木

+
49
蛇/土

2025-04-12
041期
34
猴/金

36
马/土

19
猪/土

21
鸡/水

49
蛇/土

47
羊/火

+
14
龙/水

2025-04-10
040期
26
龙/金

35
羊/土

32
狗/火

22
猴/水

23
羊/木

11
羊/金

+
02
龙/火

2025-04-08
039期
36
马/土

17
牛/火

27
兔/土

20
狗/土

11
羊/金

48
马/火

+
21
鸡/水

2025-04-05
038期
26
龙/金

07
猪/木

44
狗/水

11
羊/金

39
兔/火

22
猴/水

+
08
狗/木

2025-04-03
037期
02
龙/火

32
狗/火

07
猪/木

40
虎/火

04
虎/金

29
牛/水

+
44
狗/水

2025-04-01
036期
06
鼠/土

17
牛/火

14
龙/水

30
鼠/水

42
鼠/金

35
羊/土

+
49
蛇/土

2025-03-29
035期
47
羊/火

13
蛇/水

45
鸡/木

03
兔/金

12
马/金

05
牛/土

+
46
猴/木

2025-03-27
034期
10
猴/火

49
蛇/土

47
羊/火

19
猪/土

44
狗/水

35
羊/土

+
15
兔/木

2025-03-25
033期
36
马/土

17
牛/火

48
马/火

11
羊/金

43
猪/水

08
狗/木

+
25
蛇/金

2025-03-22
032期
36
马/土

27
兔/土

24
马/木

46
猴/木

12
马/金

23
羊/木

+
43
猪/水

2025-03-20
031期
24
马/木

20
狗/土

21
鸡/水

39
兔/火

16
虎/木

43
猪/水

+
34
猴/金

2025-03-18
030期
08
狗/木

29
牛/水

45
鸡/木

26
龙/金

24
马/木

06
鼠/土

+
39
兔/火

2025-03-16
029期
29
牛/水

49
蛇/土

48
马/火

30
鼠/水

41
牛/金

36
马/土

+
14
龙/水

2025-03-13
028期
16
虎/木

04
虎/金

26
龙/金

19
猪/土

21
鸡/水

29
牛/水

+
13
蛇/水

2025-03-11
027期
21
鸡/水

04
虎/金

37
蛇/木

09
鸡/火

14
龙/水

01
蛇/火

+
45
鸡/木

2025-03-08
026期
29
牛/水

32
狗/火

19
猪/土

25
蛇/金

26
龙/金

39
兔/火

+
04
虎/金

2025-03-06
025期
04
虎/金

19
猪/土

20
狗/土

39
兔/火

30
鼠/水

11
羊/金

+
45
鸡/木

2025-03-04
024期
43
猪/水

38
龙/木

42
鼠/金

09
鸡/火

01
蛇/火

14
龙/水

+
23
羊/木

2025-03-01
023期
04
虎/金

25
蛇/金

15
兔/木

22
猴/水

29
牛/水

42
鼠/金

+
01
蛇/火

2025-02-27
022期
07
猪/木

11
羊/金

25
蛇/金

15
兔/木

17
牛/火

28
虎/土

+
09
鸡/火

2025-02-25
021期
01
蛇/火

47
羊/火

40
虎/火

11
羊/金

06
鼠/土

02
龙/火

+
32
狗/火

2025-02-22
020期
14
龙/水

15
兔/木

44
狗/水

20
狗/土

27
兔/土

41
牛/金

+
33
鸡/金

2025-02-20
019期
41
牛/金

20
狗/土

22
猴/水

27
兔/土

44
狗/水

13
蛇/水

+
36
马/土

2025-02-18
018期
07
猪/木

39
兔/火

35
羊/土

37
蛇/木

13
蛇/水

03
兔/金

+
23
羊/木

2025-02-15
017期
21
鸡/水

25
蛇/金

08
狗/木

29
牛/水

01
蛇/火

34
猴/金

+
04
虎/金

2025-02-13
016期
45
鸡/木

32
狗/火

29
牛/水

42
鼠/金

05
牛/土

26
龙/金

+
36
马/土

2025-02-11
015期
20
狗/土

15
兔/木

26
龙/金

05
牛/土

30
鼠/水

40
虎/火

+
39
兔/火

2025-02-08
014期
07
猪/木

45
鸡/木

21
鸡/水

01
蛇/火

33
鸡/金

27
兔/土

+
17
牛/火

2025-02-06
013期
45
鸡/木

04
虎/金

38
龙/木

25
蛇/金

18
鼠/火

01
蛇/火

+
23
羊/木

2025-02-04
012期
19
猪/土

13
蛇/水

15
兔/木

03
兔/金

24
马/木

18
鼠/火

+
37
蛇/木

2025-02-02
011期
42
鼠/金

40
虎/火

18
鼠/火

36
马/土

30
鼠/水

14
龙/水

+
01
蛇/火

2025-01-25
010期
19
狗/土

31
狗/火

07
狗/木

36
蛇/木

45
猴/木

14
兔/木

+
24
蛇/金

2025-01-23
009期
06
猪/木

37
龙/木

24
蛇/金

25
龙/金

03
虎/金

34
羊/土

+
45
猴/木

2025-01-21
008期
16
牛/火

48
蛇/土

43
狗/水

22
羊/木

49
龙/土

33
猴/金

+
08
鸡/火

2025-01-18
007期
18
猪/土

32
鸡/金

12
蛇/水

04
牛/土

06
猪/木

03
虎/金

+
28
牛/水

2025-01-16
006期
03
虎/金

04
牛/土

19
狗/土

45
猴/木

38
兔/火

01
龙/火

+
39
虎/火

2025-01-14
005期
48
蛇/土

12
蛇/水

03
虎/金

18
猪/土

11
马/金

05
鼠/土

+
06
猪/木

2025-01-11
004期
35
马/土

08
鸡/火

27
虎/土

26
兔/土

30
猪/火

15
虎/木

+
02
兔/金

2025-01-09
003期
33
猴/金

01
龙/火

19
狗/土

28
牛/水

41
鼠/金

35
马/土

+
11
马/金

2025-01-07
002期
31
狗/火

47
马/火

13
龙/水

23
马/木

08
鸡/火

18
猪/土

+
16
牛/火

2025-01-02
001期
45
猴/木

09
猴/火

46
羊/火

44
鸡/木

23
马/木

42
猪/水

+
22
羊/木

2024-12-28
140期
01
龙/火

05
鼠/土

26
兔/土

18
猪/土

35
马/土

03
虎/金

+
14
兔/木

2024-12-24
139期
23
马/木

08
鸡/火

25
龙/金

18
猪/土

11
马/金

41
鼠/金

+
45
猴/木

2024-12-21
138期
22
羊/木

30
猪/火

21
猴/水

20
鸡/水

14
兔/木

23
马/木

+
18
猪/土

2024-12-19
137期
01
龙/火

37
龙/木

02
兔/金

41
鼠/金

03
虎/金

36
蛇/木

+
10
羊/金

2024-12-17
136期
48
蛇/土

26
兔/土

11
马/金

30
猪/火

09
猴/火

23
马/木

+
28
牛/水

2024-12-14
135期
46
羊/火

37
龙/木

36
蛇/木

01
龙/火

16
牛/火

18
猪/土

+
38
兔/火

2024-12-12
134期
16
牛/火

21
猴/水

14
兔/木

37
龙/木

49
龙/土

10
羊/金

+
22
羊/木

2024-12-10
133期
44
鸡/木

03
虎/金

18
猪/土

24
蛇/金

33
猴/金

43
狗/水

+
04
牛/土

2024-12-07
132期
01
龙/火

15
虎/木

34
羊/土

39
虎/火

18
猪/土

33
猴/金

+
22
羊/木

2024-12-05
131期
29
鼠/水

38
兔/火

12
蛇/水

40
牛/金

05
鼠/土

27
虎/土

+
22
羊/木

2024-12-03
130期
22
羊/木

13
龙/水

28
牛/水

02
兔/金

15
虎/木

17
鼠/火

+
23
马/木

2024-11-30
129期
10
羊/金

24
蛇/金

14
兔/木

41
鼠/金

23
马/木

33
猴/金

+
38
兔/火

2024-11-28
128期
09
猴/火

15
虎/木

26
兔/土

44
鸡/木

32
鸡/金

33
猴/金

+
01
龙/火

2024-11-26
127期
44
鸡/木

08
鸡/火

28
牛/水

12
蛇/水

11
马/金

29
鼠/水

+
34
羊/土

2024-11-23
126期
07
狗/木

01
龙/火

14
兔/木

25
龙/金

02
兔/金

15
虎/木

+
35
马/土

2024-11-21
125期
32
鸡/金

06
猪/木

14
兔/木

03
虎/金

34
羊/土

01
龙/火

+
12
蛇/水

2024-11-19
124期
39
虎/火

19
狗/土

32
鸡/金

47
马/火

38
兔/火

36
蛇/木

+
29
鼠/水

2024-11-16
123期
01
龙/火

38
兔/火

07
狗/木

03
虎/金

31
狗/火

19
狗/土

+
23
马/木

2024-11-14
122期
36
蛇/木

39
虎/火

14
兔/木

20
鸡/水

28
牛/水

08
鸡/火

+
30
猪/火

2024-11-12
121期
22
羊/木

13
龙/水

45
猴/木

27
虎/土

05
鼠/土

46
羊/火

+
07
狗/木

2024-11-10
120期
03
虎/金

24
蛇/金

27
虎/土

30
猪/火

20
鸡/水

42
猪/水

+
17
鼠/火

2024-11-07
119期
17
鼠/火

33
猴/金

44
鸡/木

11
马/金

36
蛇/木

40
牛/金

+
02
兔/金

2024-11-05
118期
13
龙/水

27
虎/土

24
蛇/金

07
狗/木

11
马/金

31
狗/火

+
35
马/土

2024-11-02
117期
25
龙/金

14
兔/木

45
猴/木

41
鼠/金

16
牛/火

40
牛/金

+
27
虎/土

2024-10-31
116期
07
狗/木

13
龙/水

16
牛/火

31
狗/火

23
马/木

22
羊/木

+
06
猪/木

2024-10-28
115期
13
龙/水

05
鼠/土

15
虎/木

06
猪/木

49
龙/土

36
蛇/木

+
23
马/木

2024-10-22
114期
28
牛/水

49
龙/土

30
猪/火

13
龙/水

21
猴/水

41
鼠/金

+
03
虎/金

2024-10-17
113期
17
鼠/火

33
猴/金

11
马/金

22
羊/木

46
羊/火

26
兔/土

+
35
马/土

2024-10-15
112期
43
狗/水

37
龙/木

44
鸡/木

19
狗/土

36
蛇/木

49
龙/土

+
08
鸡/火

2024-10-12
111期
20
鸡/水

48
蛇/土

04
牛/土

09
猴/火

08
鸡/火

19
狗/土

+
21
猴/水

2024-10-10
110期
40
牛/金

44
鸡/木

48
蛇/土

35
马/土

33
猴/金

10
羊/金

+
06
猪/木

2024-10-08
109期
10
羊/金

16
牛/火

32
鸡/金

24
蛇/金

37
龙/木

40
牛/金

+
19
狗/土

2024-10-02
108期
32
鸡/金

47
马/火

21
猴/水

08
鸡/火

43
狗/水

15
虎/木

+
41
鼠/金

2024-09-26
107期
04
牛/土

29
鼠/水

49
龙/土

38
兔/火

02
兔/金

35
马/土

+
14
兔/木

2024-09-24
106期
40
牛/金

28
牛/水

49
龙/土

17
鼠/火

09
猴/火

31
狗/火

+
25
龙/金

2024-09-21
105期
14
兔/木

02
兔/金

36
蛇/木

25
龙/金

03
虎/金

27
虎/土

+
45
猴/木

2024-09-19
104期
24
蛇/金

18
猪/土

44
鸡/木

47
马/火

05
鼠/土

21
猴/水

+
20
鸡/水

2024-09-17
103期
44
鸡/木

05
鼠/土

24
蛇/金

27
虎/土

18
猪/土

21
猴/水

+
10
羊/金

2024-09-12
102期
18
猪/土

25
龙/金

32
鸡/金

20
鸡/水

43
狗/水

14
兔/木

+
45
猴/木

2024-09-10
101期
21
猴/水

30
猪/火

16
牛/火

12
蛇/水

01
龙/火

20
鸡/水

+
27
虎/土

2024-09-07
100期
26
兔/土

35
马/土

40
牛/金

24
蛇/金

05
鼠/土

32
鸡/金

+
16
牛/火

2024-09-03
099期
07
狗/木

48
蛇/土

03
虎/金

25
龙/金

02
兔/金

46
羊/火

+
13
龙/水

2024-08-31
098期
02
兔/金

34
羊/土

21
猴/水

41
鼠/金

47
马/火

36
蛇/木

+
31
狗/火

2024-08-29
097期
07
狗/木

18
猪/土

24
蛇/金

29
鼠/水

06
猪/木

28
牛/水

+
01
龙/火

2024-08-27
096期
15
虎/木

33
猴/金

39
虎/火

02
兔/金

23
马/木

34
羊/土

+
19
狗/土

2024-08-24
095期
31
狗/火

09
猴/火

28
牛/水

41
鼠/金

19
狗/土

15
虎/木

+
42
猪/水

2024-08-22
094期
33
猴/金

09
猴/火

32
鸡/金

08
鸡/火

21
猴/水

16
牛/火

+
34
羊/土

2024-08-20
093期
26
兔/土

39
虎/火

49
龙/土

01
龙/火

16
牛/火

04
牛/土

+
07
狗/木

2024-08-17
092期
13
龙/水

21
猴/水

19
狗/土

28
牛/水

06
猪/木

26
兔/土

+
09
猴/火

2024-08-15
091期
35
马/土

03
虎/金

16
牛/火

33
猴/金

39
虎/火

44
鸡/木

+
08
鸡/火

2024-08-13
090期
09
猴/火

20
鸡/水

30
猪/火

07
狗/木

35
马/土

21
猴/水

+
26
兔/土

2024-08-10
089期
45
猴/木

12
蛇/水

21
猴/水

08
鸡/火

35
马/土

44
鸡/木

+
02
兔/金

2024-08-08
088期
03
虎/金

06
猪/木

08
鸡/火

11
马/金

07
狗/木

29
鼠/水

+
49
龙/土

2024-08-06
087期
41
鼠/金

04
牛/土

03
虎/金

27
虎/土

13
龙/水

07
狗/木

+
38
兔/火

2024-08-03
086期
26
兔/土

06
猪/木

08
鸡/火

22
羊/木

44
鸡/木

05
鼠/土

+
40
牛/金

2024-08-01
085期
02
兔/金

43
狗/水

16
牛/火

39
虎/火

46
羊/火

09
猴/火

+
20
鸡/水

2024-07-30
084期
25
龙/金

21
猴/水

07
狗/木

06
猪/木

17
鼠/火

20
鸡/水

+
26
兔/土

2024-07-25
083期
43
狗/水

26
兔/土

18
猪/土

16
牛/火

03
虎/金

45
猴/木

+
09
猴/火

2024-07-23
082期
12
蛇/水

34
羊/土

25
龙/金

13
龙/水

24
蛇/金

27
虎/土

+
04
牛/土

2024-07-20
081期
39
虎/火

41
鼠/金

18
猪/土

31
狗/火

17
鼠/火

33
猴/金

+
14
兔/木

2024-07-18
080期
30
猪/火

11
马/金

29
鼠/水

28
牛/水

12
蛇/水

18
猪/土

+
39
虎/火

2024-07-16
079期
11
马/金

17
鼠/火

47
马/火

13
龙/水

40
牛/金

34
羊/土

+
21
猴/水

2024-07-13
078期
24
蛇/金

27
虎/土

21
猴/水

48
蛇/土

29
鼠/水

17
鼠/火

+
08
鸡/火

2024-07-11
077期
44
鸡/木

20
鸡/水

34
羊/土

08
鸡/火

29
鼠/水

33
猴/金

+
12
蛇/水

2024-07-09
076期
36
蛇/木

40
牛/金

18
猪/土

30
猪/火

25
龙/金

35
马/土

+
44
鸡/木

2024-07-07
075期
41
鼠/金

01
龙/火

02
兔/金

27
虎/土

34
羊/土

17
鼠/火

+
22
羊/木

2024-07-02
074期
21
猴/水

15
虎/木

05
鼠/土

27
虎/土

08
鸡/火

37
龙/木

+
02
兔/金

2024-06-29
073期
36
蛇/木

29
鼠/水

07
狗/木

30
猪/火

21
猴/水

46
羊/火

+
42
猪/水

2024-06-27
072期
30
猪/火

17
鼠/火

32
鸡/金

40
牛/金

24
蛇/金

02
兔/金

+
16
牛/火

2024-06-25
071期
40
牛/金

34
羊/土

48
蛇/土

49
龙/土

30
猪/火

21
猴/水

+
16
牛/火

2024-06-22
070期
25
龙/金

18
猪/土

34
羊/土

49
龙/土

42
猪/水

28
牛/水

+
14
兔/木

2024-06-20
069期
21
猴/水

42
猪/水

26
兔/土

27
虎/土

46
羊/火

14
兔/木

+
45
猴/木

2024-06-18
068期
38
兔/火

33
猴/金

31
狗/火

09
猴/火

48
蛇/土

16
牛/火

+
23
马/木

2024-06-16
067期
03
虎/金

13
龙/水

07
狗/木

21
猴/水

49
龙/土

17
鼠/火

+
04
牛/土

2024-06-13
066期
15
虎/木

05
鼠/土

01
龙/火

19
狗/土

39
虎/火

25
龙/金

+
46
羊/火

2024-06-09
065期
09
猴/火

06
猪/木

17
鼠/火

12
蛇/水

19
狗/土

42
猪/水

+
13
龙/水

2024-06-04
064期
43
狗/水

19
狗/土

27
虎/土

06
猪/木

11
马/金

21
猴/水

+
44
鸡/木

2024-06-01
063期
18
猪/土

28
牛/水

48
蛇/土

36
蛇/木

06
猪/木

33
猴/金

+
11
马/金

2024-05-30
062期
24
蛇/金

25
龙/金

01
龙/火

27
虎/土

30
猪/火

32
鸡/金

+
13
龙/水

2024-05-28
061期
43
狗/水

37
龙/木

38
兔/火

44
鸡/木

46
羊/火

33
猴/金

+
32
鸡/金

2024-05-25
060期
49
龙/土

26
兔/土

46
羊/火

37
龙/木

30
猪/火

07
狗/木

+
25
龙/金

2024-05-23
059期
05
鼠/土

18
猪/土

36
蛇/木

09
猴/火

40
牛/金

21
猴/水

+
13
龙/水

2024-05-21
058期
04
牛/土

02
兔/金

37
龙/木

03
虎/金

15
虎/木

40
牛/金

+
08
鸡/火

2024-05-18
057期
45
猴/木

27
虎/土

17
鼠/火

08
鸡/火

33
猴/金

19
狗/土

+
37
龙/木

2024-05-16
056期
49
龙/土

40
牛/金

43
狗/水

21
猴/水

44
鸡/木

32
鸡/金

+
01
龙/火

2024-05-14
055期
45
猴/木

41
鼠/金

49
龙/土

14
兔/木

37
龙/木

38
兔/火

+
05
鼠/土

2024-05-12
054期
25
龙/金

30
猪/火

36
蛇/木

09
猴/火

03
虎/金

41
鼠/金

+
19
狗/土

2024-05-09
053期
23
马/木

05
鼠/土

15
虎/木

14
兔/木

18
猪/土

48
蛇/土

+
13
龙/水

2024-05-07
052期
42
猪/水

19
狗/土

27
虎/土

30
猪/火

08
鸡/火

36
蛇/木

+
02
兔/金

2024-05-04
051期
28
牛/水

21
猴/水

01
龙/火

07
狗/木

03
虎/金

30
猪/火

+
45
猴/木

2024-05-02
050期
42
猪/水

46
羊/火

39
虎/火

18
猪/土

21
猴/水

06
猪/木

+
17
鼠/火

2024-04-30
049期
39
虎/火

11
马/金

37
龙/木

28
牛/水

12
蛇/水

35
马/土

+
30
猪/火

2024-04-27
048期
28
牛/水

40
牛/金

09
猴/火

48
蛇/土

18
猪/土

47
马/火

+
23
马/木

2024-04-25
047期
03
虎/金

36
蛇/木

25
龙/金

32
鸡/金

38
兔/火

17
鼠/火

+
46
羊/火

2024-04-23
046期
37
龙/木

05
鼠/土

06
猪/木

27
虎/土

16
牛/火

47
马/火

+
24
蛇/金

2024-04-21
045期
07
狗/木

10
羊/金

08
鸡/火

27
虎/土

17
鼠/火

12
蛇/水

+
25
龙/金

2024-04-18
044期
26
兔/土

38
兔/火

48
蛇/土

30
猪/火

17
鼠/火

25
龙/金

+
28
牛/水

2024-04-16
043期
17
鼠/火

14
兔/木

18
猪/土

12
蛇/水

23
马/木

44
鸡/木

+
27
虎/土

2024-04-13
042期
12
蛇/水

06
猪/木

17
鼠/火

10
羊/金

14
兔/木

41
鼠/金

+
47
马/火

2024-04-11
041期
09
猴/火

02
兔/金

35
马/土

33
猴/金

07
狗/木

13
龙/水

+
49
龙/土

2024-04-09
040期
13
龙/水

48
蛇/土

34
羊/土

30
猪/火

20
鸡/水

29
鼠/水

+
03
虎/金

2024-04-06
039期
30
猪/火

34
羊/土

35
马/土

17
鼠/火

15
虎/木

16
牛/火

+
25
龙/金

2024-04-04
038期
12
蛇/水

08
鸡/火

26
兔/土

04
牛/土

24
蛇/金

22
羊/木

+
01
龙/火

2024-04-02
037期
42
猪/水

44
鸡/木

25
龙/金

31
狗/火

16
牛/火

43
狗/水

+
07
狗/木

2024-03-30
036期
06
猪/木

02
兔/金

36
蛇/木

39
虎/火

18
猪/土

22
羊/木

+
21
猴/水

2024-03-28
035期
02
兔/金

15
虎/木

09
猴/火

48
蛇/土

39
虎/火

20
鸡/水

+
43
狗/水

2024-03-26
034期
42
猪/水

18
猪/土

11
马/金

12
蛇/水

06
猪/木

24
蛇/金

+
38
兔/火

2024-03-23
033期
18
猪/土

24
蛇/金

42
猪/水

11
马/金

46
羊/火

35
马/土

+
03
虎/金

2024-03-21
032期
20
鸡/水

06
猪/木

34
羊/土

39
虎/火

42
猪/水

19
狗/土

+
44
鸡/木

2024-03-19
031期
30
猪/火

36
蛇/木

08
鸡/火

29
鼠/水

48
蛇/土

07
狗/木

+
28
牛/水

2024-03-17
030期
23
马/木

40
牛/金

01
龙/火

08
鸡/火

44
鸡/木

13
龙/水

+
15
虎/木

2024-03-14
029期
24
蛇/金

49
龙/土

23
马/木

06
猪/木

34
羊/土

31
狗/火

+
01
龙/火

2024-03-12
028期
16
牛/火

43
狗/水

13
龙/水

18
猪/土

24
蛇/金

32
鸡/金

+
44
鸡/木

2024-03-09
027期
32
鸡/金

21
猴/水

04
牛/土

05
鼠/土

08
鸡/火

42
猪/水

+
45
猴/木

2024-03-07
026期
39
虎/火

30
猪/火

22
羊/木

31
狗/火

32
鸡/金

05
鼠/土

+
44
鸡/木

2024-03-05
025期
11
马/金

34
羊/土

42
猪/水

24
蛇/金

36
蛇/木

39
虎/火

+
38
兔/火

2024-03-02
024期
35
马/土

46
羊/火

43
狗/水

07
狗/木

23
马/木

31
狗/火

+
10
羊/金

2024-02-29
023期
41
鼠/金

13
龙/水

36
蛇/木

05
鼠/土

39
虎/火

16
牛/火

+
38
兔/火

2024-02-27
022期
24
蛇/金

22
羊/木

26
兔/土

12
蛇/水

03
虎/金

11
马/金

+
21
猴/水

2024-02-24
021期
02
兔/金

07
狗/木

30
猪/火

36
蛇/木

24
蛇/金

29
鼠/水

+
06
猪/木

2024-02-22
020期
34
羊/土

22
羊/木

25
龙/金

33
猴/金

39
虎/火

35
马/土

+
05
鼠/土

2024-02-20
019期
27
虎/土

26
兔/土

45
猴/木

10
羊/金

30
猪/火

29
鼠/水

+
37
龙/木

2024-02-17
018期
26
兔/土

09
猴/火

23
马/木

41
鼠/金

36
蛇/木

27
虎/土

+
24
蛇/金

2024-02-14
017期
24
蛇/金

12
蛇/水

48
蛇/土

10
羊/金

13
龙/水

25
龙/金

+
15
虎/木

2024-02-08
016期
07
鸡/火

25
兔/土

22
马/木

20
猴/水

05
猪/木

09
羊/金

+
13
兔/木

2024-02-06
015期
15
牛/火

18
狗/土

19
鸡/水

49
兔/水

41
猪/水

38
虎/火

+
22
马/木

2024-02-03
014期
32
猴/金

21
羊/木

03
牛/土

07
鸡/火

36
龙/木

47
蛇/土

+
23
蛇/金

2024-02-01
013期
12
龙/水

23
蛇/金

04
鼠/土

24
龙/金

31
鸡/金

15
牛/火

+
43
鸡/木

2024-01-30
012期
20
猴/水

21
羊/木

49
兔/水

08
猴/火

30
狗/火

29
猪/火

+
32
猴/金

2024-01-27
011期
08
猴/火

47
蛇/土

01
兔/金

34
马/土

19
鸡/水

13
兔/木

+
12
龙/水

2024-01-25
010期
05
猪/木

45
羊/火

02
虎/金

15
牛/火

49
兔/水

32
猴/金

+
19
鸡/水

2024-01-23
009期
30
狗/火

43
鸡/木

02
虎/金

14
虎/木

06
狗/木

07
鸡/火

+
15
牛/火

2024-01-20
008期
03
牛/土

48
龙/土

31
鸡/金

40
鼠/金

43
鸡/木

25
兔/土

+
45
羊/火

2024-01-18
007期
02
虎/金

17
猪/土

10
马/金

47
蛇/土

46
马/火

49
兔/水

+
03
牛/土

2024-01-16
006期
41
猪/水

06
狗/木

27
牛/水

08
猴/火

01
兔/金

47
蛇/土

+
29
猪/火

2024-01-14
005期
38
虎/火

03
牛/土

18
狗/土

17
猪/土

39
牛/金

36
龙/木

+
21
羊/木

2024-01-11
004期
06
狗/木

08
猴/火

29
猪/火

38
虎/火

26
虎/土

03
牛/土

+
01
兔/金

2024-01-09
003期
09
羊/金

03
牛/土

19
鸡/水

16
鼠/火

35
蛇/木

33
羊/土

+
39
牛/金

2024-01-06
002期
31
鸡/金

33
羊/土

01
兔/金

04
鼠/土

34
马/土

24
龙/金

+
02
虎/金

2024-01-03
001期
46
马/火

34
马/土

03
牛/土

02
虎/金

37
兔/火

19
鸡/水

+
32
猴/金
`
