const oldD = `

2026-08-07
219期
05
虎/金

10
鸡/火

19
鼠/火

30
牛/水

35
猴/金

47
猴/木

+
25
马/木

2026-08-06
218期
37
马/土

32
猪/火

33
狗/火

15
龙/水

22
鸡/水

43
鼠/金

+
41
虎/火

2026-08-05
217期
40
兔/火

29
虎/土

17
虎/木

18
牛/火

31
鼠/水

32
猪/火

+
34
鸡/金

2026-08-04
216期
34
鸡/金

35
猴/金

10
鸡/火

47
猴/木

31
鼠/水

38
蛇/木

+
49
马/火

2026-08-03
215期
26
蛇/金

29
虎/土

23
猴/水

07
鼠/土

13
马/金

36
羊/土

+
18
牛/火

2026-08-02
214期
42
牛/金

31
鼠/水

22
鸡/水

37
马/土

01
马/水

41
虎/火

+
08
猪/木

2026-08-01
213期
08
猪/木

43
鼠/金

20
猪/土

02
蛇/火

24
羊/木

48
羊/火

+
10
鸡/火

2026-07-31
212期
12
羊/金

36
羊/土

20
猪/土

44
猪/水

49
马/火

31
鼠/水

+
10
鸡/火

2026-07-30
211期
21
狗/土

31
鼠/水

04
兔/金

30
牛/水

49
马/火

27
龙/金

+
17
虎/木

2026-07-29
210期
04
兔/金

08
猪/木

29
虎/土

43
鼠/金

14
蛇/水

36
羊/土

+
16
兔/木

2026-07-28
209期
29
虎/土

39
龙/木

26
蛇/金

22
鸡/水

05
虎/金

49
马/火

+
41
虎/火

2026-07-27
208期
49
马/火

14
蛇/水

12
羊/金

28
兔/土

30
牛/水

11
猴/火

+
04
兔/金

2026-07-26
207期
32
猪/火

30
牛/水

47
猴/木

38
蛇/木

26
蛇/金

39
龙/木

+
42
牛/金

2026-07-25
206期
17
虎/木

29
虎/土

36
羊/土

43
鼠/金

13
马/金

49
马/火

+
26
蛇/金

2026-07-24
205期
04
兔/金

06
牛/土

43
鼠/金

23
猴/水

13
马/金

19
鼠/火

+
21
狗/土

2026-07-23
204期
20
猪/土

28
兔/土

33
狗/火

39
龙/木

01
马/水

38
蛇/木

+
31
鼠/水

2026-07-22
203期
22
鸡/水

24
羊/木

48
羊/火

45
狗/水

31
鼠/水

26
蛇/金

+
09
狗/木

2026-07-21
202期
13
马/金

32
猪/火

24
羊/木

21
狗/土

39
龙/木

47
猴/木

+
41
虎/火

2026-07-20
201期
19
鼠/火

04
兔/金

32
猪/火

46
鸡/木

29
虎/土

47
猴/木

+
45
狗/水

2026-07-19
200期
31
鼠/水

45
狗/水

22
鸡/水

10
鸡/火

34
鸡/金

36
羊/土

+
16
兔/木

2026-07-18
199期
25
马/木

46
鸡/木

02
蛇/火

06
牛/土

15
龙/水

42
牛/金

+
22
鸡/水

2026-07-17
198期
40
兔/火

23
猴/水

07
鼠/土

28
兔/土

48
羊/火

43
鼠/金

+
26
蛇/金

2026-07-16
197期
10
鸡/火

48
羊/火

40
兔/火

16
兔/木

01
马/水

27
龙/金

+
29
虎/土

2026-07-15
196期
46
鸡/木

19
鼠/火

48
羊/火

49
马/火

17
虎/木

43
鼠/金

+
12
羊/金

2026-07-14
195期
39
龙/木

06
牛/土

37
马/土

11
猴/火

45
狗/水

42
牛/金

+
47
猴/木

2026-07-13
194期
31
鼠/水

14
蛇/水

35
猴/金

36
羊/土

16
兔/木

49
马/火

+
38
蛇/木

2026-07-12
193期
39
龙/木

32
猪/火

21
狗/土

45
狗/水

15
龙/水

12
羊/金

+
40
兔/火

2026-07-11
192期
27
龙/金

12
羊/金

38
蛇/木

47
猴/木

37
马/土

43
鼠/金

+
22
鸡/水

2026-07-10
191期
24
羊/木

18
牛/火

07
鼠/土

45
狗/水

06
牛/土

42
牛/金

+
03
龙/火

2026-07-09
190期
38
蛇/木

44
猪/水

01
马/水

42
牛/金

31
鼠/水

16
兔/木

+
13
马/金

2026-07-08
189期
19
鼠/火

32
猪/火

46
鸡/木

15
龙/水

33
狗/火

07
鼠/土

+
41
虎/火

2026-07-07
188期
37
马/土

04
兔/金

46
鸡/木

45
狗/水

10
鸡/火

26
蛇/金

+
32
猪/火

2026-07-06
187期
43
鼠/金

44
猪/水

48
羊/火

21
狗/土

02
蛇/火

08
猪/木

+
32
猪/火

2026-07-05
186期
34
鸡/金

47
猴/木

10
鸡/火

49
马/火

37
马/土

15
龙/水

+
23
猴/水

2026-07-04
185期
44
猪/水

19
鼠/火

26
蛇/金

47
猴/木

03
龙/火

46
鸡/木

+
11
猴/火

2026-07-03
184期
09
狗/木

49
马/火

22
鸡/水

02
蛇/火

47
猴/木

45
狗/水

+
37
马/土

2026-07-02
183期
42
牛/金

30
牛/水

23
猴/水

44
猪/水

10
鸡/火

04
兔/金

+
27
龙/金

2026-07-01
182期
07
鼠/土

16
兔/木

39
龙/木

20
猪/土

08
猪/木

49
马/火

+
43
鼠/金

2026-06-30
181期
03
龙/火

48
羊/火

40
兔/火

38
蛇/木

08
猪/木

18
牛/火

+
30
牛/水

2026-06-29
180期
29
虎/土

13
马/金

14
蛇/水

42
牛/金

24
羊/木

03
龙/火

+
33
狗/火

2026-06-28
179期
38
蛇/木

29
虎/土

04
兔/金

39
龙/木

23
猴/水

11
猴/火

+
32
猪/火

2026-06-27
178期
27
龙/金

10
鸡/火

47
猴/木

08
猪/木

48
羊/火

41
虎/火

+
38
蛇/木

2026-06-26
177期
32
猪/火

10
鸡/火

41
虎/火

31
鼠/水

38
蛇/木

20
猪/土

+
36
羊/土

2026-06-25
176期
13
马/金

44
猪/水

22
鸡/水

24
羊/木

11
猴/火

15
龙/水

+
16
兔/木

2026-06-24
175期
16
兔/木

12
羊/金

47
猴/木

06
牛/土

31
鼠/水

20
猪/土

+
38
蛇/木

2026-06-23
174期
22
鸡/水

39
龙/木

10
鸡/火

19
鼠/火

38
蛇/木

47
猴/木

+
33
狗/火

2026-06-22
173期
40
兔/火

47
猴/木

18
牛/火

49
马/火

28
兔/土

29
虎/土

+
43
鼠/金

2026-06-21
172期
05
虎/金

29
虎/土

39
龙/木

01
马/水

13
马/金

32
猪/火

+
26
蛇/金

2026-06-20
171期
23
猴/水

25
马/木

29
虎/土

46
鸡/木

09
狗/木

06
牛/土

+
24
羊/木

2026-06-19
170期
26
蛇/金

19
鼠/火

47
猴/木

17
虎/木

44
猪/水

29
虎/土

+
31
鼠/水

2026-06-18
169期
14
蛇/水

20
猪/土

27
龙/金

33
狗/火

40
兔/火

26
蛇/金

+
39
龙/木

2026-06-17
168期
29
虎/土

26
蛇/金

05
虎/金

30
牛/水

07
鼠/土

32
猪/火

+
28
兔/土

2026-06-16
167期
38
蛇/木

43
鼠/金

09
狗/木

47
猴/木

23
猴/水

20
猪/土

+
41
虎/火

2026-06-15
166期
43
鼠/金

30
牛/水

02
蛇/火

13
马/金

01
马/水

16
兔/木

+
24
羊/木

2026-06-14
165期
26
蛇/金

35
猴/金

01
马/水

07
鼠/土

40
兔/火

37
马/土

+
34
鸡/金

2026-06-13
164期
19
鼠/火

15
龙/水

17
虎/木

46
鸡/木

18
牛/火

36
羊/土

+
42
牛/金

2026-06-12
163期
10
鸡/火

12
羊/金

31
鼠/水

46
鸡/木

19
鼠/火

26
蛇/金

+
27
龙/金

2026-06-11
162期
27
龙/金

21
狗/土

11
猴/火

39
龙/木

08
猪/木

05
虎/金

+
31
鼠/水

2026-06-10
161期
16
兔/木

15
龙/水

02
蛇/火

36
羊/土

48
羊/火

01
马/水

+
35
猴/金

2026-06-09
160期
27
龙/金

46
鸡/木

41
虎/火

02
蛇/火

19
鼠/火

16
兔/木

+
25
马/木

2026-06-08
159期
35
猴/金

36
羊/土

41
虎/火

39
龙/木

37
马/土

46
鸡/木

+
12
羊/金

2026-06-07
158期
02
蛇/火

16
兔/木

40
兔/火

22
鸡/水

46
鸡/木

11
猴/火

+
26
蛇/金

2026-06-06
157期
07
鼠/土

15
龙/水

32
猪/火

23
猴/水

43
鼠/金

18
牛/火

+
38
蛇/木

2026-06-05
156期
32
猪/火

01
马/水

47
猴/木

34
鸡/金

45
狗/水

09
狗/木

+
12
羊/金

2026-06-04
155期
44
猪/水

20
猪/土

36
羊/土

02
蛇/火

09
狗/木

47
猴/木

+
18
牛/火

2026-06-03
154期
11
猴/火

19
鼠/火

27
龙/金

06
牛/土

46
鸡/木

32
猪/火

+
21
狗/土

2026-06-02
153期
11
猴/火

09
狗/木

45
狗/水

14
蛇/水

25
马/木

39
龙/木

+
18
牛/火

2026-06-01
152期
45
狗/水

22
鸡/水

43
鼠/金

27
龙/金

28
兔/土

05
虎/金

+
17
虎/木

2026-05-31
151期
46
鸡/木

24
羊/木

09
狗/木

04
兔/金

39
龙/木

49
马/火

+
48
羊/火

2026-05-30
150期
24
羊/木

22
鸡/水

44
猪/水

18
牛/火

38
蛇/木

11
猴/火

+
19
鼠/火

2026-05-29
149期
44
猪/水

36
羊/土

02
蛇/火

10
鸡/火

45
狗/水

09
狗/木

+
15
龙/水

2026-05-28
148期
02
蛇/火

46
鸡/木

01
马/水

09
狗/木

35
猴/金

03
龙/火

+
40
兔/火

2026-05-27
147期
05
虎/金

31
鼠/水

27
龙/金

03
龙/火

01
马/水

21
狗/土

+
28
兔/土

2026-05-26
146期
12
羊/金

34
鸡/金

23
猴/水

13
马/金

47
猴/木

40
兔/火

+
10
鸡/火

2026-05-25
145期
37
马/土

38
蛇/木

43
鼠/金

34
鸡/金

24
羊/木

49
马/火

+
23
猴/水

2026-05-24
144期
05
虎/金

16
兔/木

23
猴/水

09
狗/木

41
虎/火

14
蛇/水

+
25
马/木

2026-05-23
143期
02
蛇/火

17
虎/木

40
兔/火

24
羊/木

07
鼠/土

19
鼠/火

+
25
马/木

2026-05-22
142期
07
鼠/土

48
羊/火

37
马/土

14
蛇/水

46
鸡/木

40
兔/火

+
38
蛇/木

2026-05-21
141期
43
鼠/金

22
鸡/水

01
马/水

12
羊/金

47
猴/木

21
狗/土

+
34
鸡/金

2026-05-20
140期
44
猪/水

16
兔/木

05
虎/金

46
鸡/木

10
鸡/火

49
马/火

+
41
虎/火

2026-05-19
139期
07
鼠/土

39
龙/木

02
蛇/火

21
狗/土

08
猪/木

06
牛/土

+
49
马/火

2026-05-18
138期
01
马/水

31
鼠/水

49
马/火

35
猴/金

47
猴/木

22
鸡/水

+
15
龙/水

2026-05-17
137期
41
虎/火

01
马/水

44
猪/水

32
猪/火

29
虎/土

28
兔/土

+
11
猴/火

2026-05-16
136期
41
虎/火

05
虎/金

28
兔/土

36
羊/土

02
蛇/火

03
龙/火

+
45
狗/水

2026-05-15
135期
41
虎/火

18
牛/火

26
蛇/金

31
鼠/水

03
龙/火

35
猴/金

+
22
鸡/水

2026-05-14
134期
31
鼠/水

28
兔/土

48
羊/火

29
虎/土

09
狗/木

23
猴/水

+
39
龙/木

2026-05-13
133期
12
羊/金

45
狗/水

11
猴/火

32
猪/火

10
鸡/火

02
蛇/火

+
30
牛/水

2026-05-12
132期
39
龙/木

20
猪/土

29
虎/土

02
蛇/火

33
狗/火

25
马/木

+
35
猴/金

2026-05-11
131期
22
鸡/水

12
羊/金

39
龙/木

02
蛇/火

47
猴/木

07
鼠/土

+
44
猪/水

2026-05-10
130期
15
龙/水

27
龙/金

43
鼠/金

33
狗/火

04
兔/金

20
猪/土

+
29
虎/土

2026-05-09
129期
35
猴/金

05
虎/金

41
虎/火

06
牛/土

11
猴/火

26
蛇/金

+
46
鸡/木

2026-05-08
128期
49
马/火

13
马/金

15
龙/水

09
狗/木

30
牛/水

43
鼠/金

+
29
虎/土

2026-05-07
127期
27
龙/金

03
龙/火

49
马/火

33
狗/火

41
虎/火

31
鼠/水

+
10
鸡/火

2026-05-06
126期
22
鸡/水

21
狗/土

27
龙/金

02
蛇/火

26
蛇/金

30
牛/水

+
06
牛/土

2026-05-05
125期
21
狗/土

24
羊/木

03
龙/火

37
马/土

15
龙/水

44
猪/水

+
45
狗/水

2026-05-04
124期
41
虎/火

48
羊/火

45
狗/水

24
羊/木

39
龙/木

18
牛/火

+
38
蛇/木

2026-05-03
123期
01
马/水

36
羊/土

05
虎/金

31
鼠/水

08
猪/木

23
猴/水

+
42
牛/金

2026-05-02
122期
28
兔/土

19
鼠/火

29
虎/土

26
蛇/金

17
虎/木

27
龙/金

+
16
兔/木

2026-05-01
121期
04
兔/金

05
虎/金

48
羊/火

12
羊/金

49
马/火

17
虎/木

+
33
狗/火

2026-04-30
120期
07
鼠/土

46
鸡/木

28
兔/土

04
兔/金

20
猪/土

29
虎/土

+
15
龙/水

2026-04-29
119期
16
兔/木

46
鸡/木

49
马/火

37
马/土

07
鼠/土

08
猪/木

+
04
兔/金

2026-04-28
118期
02
蛇/火

26
蛇/金

43
鼠/金

25
马/木

40
兔/火

19
鼠/火

+
39
龙/木

2026-04-27
117期
39
龙/木

03
龙/火

13
马/金

12
羊/金

43
鼠/金

17
虎/木

+
16
兔/木

2026-04-26
116期
29
虎/土

20
猪/土

45
狗/水

07
鼠/土

21
狗/土

38
蛇/木

+
43
鼠/金

2026-04-25
115期
30
牛/水

22
鸡/水

35
猴/金

27
龙/金

15
龙/水

16
兔/木

+
18
牛/火

2026-04-24
114期
34
鸡/金

29
虎/土

49
马/火

22
鸡/水

45
狗/水

12
羊/金

+
30
牛/水

2026-04-23
113期
49
马/火

07
鼠/土

25
马/木

34
鸡/金

09
狗/木

35
猴/金

+
19
鼠/火

2026-04-22
112期
06
牛/土

39
龙/木

30
牛/水

14
蛇/水

02
蛇/火

43
鼠/金

+
46
鸡/木

2026-04-21
111期
20
猪/土

05
虎/金

03
龙/火

32
猪/火

01
马/水

09
狗/木

+
13
马/金

2026-04-20
110期
15
龙/水

49
马/火

31
鼠/水

05
虎/金

30
牛/水

16
兔/木

+
18
牛/火

2026-04-19
109期
47
猴/木

27
龙/金

34
鸡/金

35
猴/金

08
猪/木

41
虎/火

+
11
猴/火

2026-04-18
108期
33
狗/火

27
龙/金

08
猪/木

06
牛/土

41
虎/火

30
牛/水

+
34
鸡/金

2026-04-17
107期
17
虎/木

13
马/金

32
猪/火

16
兔/木

49
马/火

41
虎/火

+
07
鼠/土

2026-04-16
106期
09
狗/木

07
鼠/土

19
鼠/火

22
鸡/水

26
蛇/金

04
兔/金

+
43
鼠/金

2026-04-15
105期
01
马/水

03
龙/火

19
鼠/火

49
马/火

45
狗/水

38
蛇/木

+
20
猪/土

2026-04-14
104期
39
龙/木

44
猪/水

41
虎/火

28
兔/土

04
兔/金

19
鼠/火

+
42
牛/金

2026-04-13
103期
33
狗/火

37
马/土

32
猪/火

42
牛/金

41
虎/火

16
兔/木

+
03
龙/火

2026-04-12
102期
35
猴/金

44
猪/水

14
蛇/水

22
鸡/水

06
牛/土

25
马/木

+
30
牛/水

2026-04-11
101期
37
马/土

48
羊/火

25
马/木

28
兔/土

01
马/水

15
龙/水

+
33
狗/火

2026-04-10
100期
36
羊/土

29
虎/土

12
羊/金

01
马/水

06
牛/土

41
虎/火

+
45
狗/水

2026-04-09
099期
40
兔/火

42
牛/金

35
猴/金

45
狗/水

36
羊/土

37
马/土

+
23
猴/水

2026-04-08
098期
40
兔/火

04
兔/金

45
狗/水

14
蛇/水

20
猪/土

06
牛/土

+
12
羊/金

2026-04-07
097期
16
兔/木

27
龙/金

22
鸡/水

02
蛇/火

48
羊/火

36
羊/土

+
39
龙/木

2026-04-06
096期
07
鼠/土

39
龙/木

02
蛇/火

48
羊/火

45
狗/水

35
猴/金

+
11
猴/火

2026-04-05
095期
40
兔/火

13
马/金

31
鼠/水

42
牛/金

43
鼠/金

29
虎/土

+
05
虎/金

2026-04-04
094期
45
狗/水

23
猴/水

47
猴/木

39
龙/木

05
虎/金

32
猪/火

+
11
猴/火

2026-04-03
093期
33
狗/火

29
虎/土

19
鼠/火

45
狗/水

23
猴/水

06
牛/土

+
24
羊/木

2026-04-02
092期
46
鸡/木

40
兔/火

42
牛/金

07
鼠/土

03
龙/火

20
猪/土

+
28
兔/土

2026-04-01
091期
13
马/金

06
牛/土

31
鼠/水

09
狗/木

32
猪/火

10
鸡/火

+
30
牛/水

2026-03-31
090期
14
蛇/水

31
鼠/水

35
猴/金

20
猪/土

11
猴/火

08
猪/木

+
17
虎/木

2026-03-30
089期
25
马/木

29
虎/土

07
鼠/土

26
蛇/金

16
兔/木

44
猪/水

+
19
鼠/火

2026-03-29
088期
44
猪/水

05
虎/金

15
龙/水

24
羊/木

48
羊/火

20
猪/土

+
40
兔/火

2026-03-28
087期
26
蛇/金

27
龙/金

12
羊/金

35
猴/金

20
猪/土

16
兔/木

+
09
狗/木

2026-03-27
086期
49
马/火

15
龙/水

12
羊/金

47
猴/木

02
蛇/火

28
兔/土

+
26
蛇/金

2026-03-26
085期
24
羊/木

41
虎/火

28
兔/土

37
马/土

06
牛/土

45
狗/水

+
08
猪/木

2026-03-25
084期
30
牛/水

43
鼠/金

25
马/木

14
蛇/水

08
猪/木

06
牛/土

+
36
羊/土

2026-03-24
083期
17
虎/木

34
鸡/金

10
鸡/火

27
龙/金

45
狗/水

19
鼠/火

+
22
鸡/水

2026-03-23
082期
31
鼠/水

40
兔/火

42
牛/金

04
兔/金

15
龙/水

13
马/金

+
23
猴/水

2026-03-22
081期
05
虎/金

46
鸡/木

17
虎/木

06
牛/土

48
羊/火

30
牛/水

+
39
龙/木

2026-03-21
080期
09
狗/木

03
龙/火

29
虎/土

10
鸡/火

43
鼠/金

19
鼠/火

+
18
牛/火

2026-03-20
079期
29
虎/土

27
龙/金

24
羊/木

28
兔/土

01
马/水

25
马/木

+
43
鼠/金

2026-03-19
078期
03
龙/火

43
鼠/金

38
蛇/木

21
狗/土

28
兔/土

10
鸡/火

+
15
龙/水

2026-03-18
077期
24
羊/木

19
鼠/火

01
马/水

38
蛇/木

43
鼠/金

20
猪/土

+
26
蛇/金

2026-03-17
076期
24
羊/木

31
鼠/水

37
马/土

14
蛇/水

48
羊/火

12
羊/金

+
16
兔/木

2026-03-16
075期
37
马/土

22
鸡/水

33
狗/火

32
猪/火

05
虎/金

13
马/金

+
45
狗/水

2026-03-15
074期
26
蛇/金

48
羊/火

46
鸡/木

31
鼠/水

43
鼠/金

22
鸡/水

+
15
龙/水

2026-03-14
073期
33
狗/火

06
牛/土

08
猪/木

22
鸡/水

20
猪/土

39
龙/木

+
44
猪/水

2026-03-13
072期
39
龙/木

30
牛/水

03
龙/火

34
鸡/金

31
鼠/水

16
兔/木

+
48
羊/火

2026-03-12
071期
46
鸡/木

21
狗/土

30
牛/水

13
马/金

36
羊/土

41
虎/火

+
28
兔/土

2026-03-11
070期
09
狗/木

20
猪/土

43
鼠/金

31
鼠/水

48
羊/火

34
鸡/金

+
16
兔/木

2026-03-10
069期
03
龙/火

39
龙/木

20
猪/土

47
猴/木

02
蛇/火

29
虎/土

+
11
猴/火

2026-03-09
068期
33
狗/火

44
猪/水

20
猪/土

22
鸡/水

36
羊/土

17
虎/木

+
15
龙/水

2026-03-08
067期
09
狗/木

41
虎/火

21
狗/土

15
龙/水

23
猴/水

17
虎/木

+
24
羊/木

2026-03-07
066期
13
马/金

05
虎/金

34
鸡/金

18
牛/火

20
猪/土

21
狗/土

+
41
虎/火

2026-03-06
065期
43
鼠/金

47
猴/木

06
牛/土

05
虎/金

27
龙/金

42
牛/金

+
09
狗/木

2026-03-05
064期
32
猪/火

43
鼠/金

06
牛/土

41
虎/火

48
羊/火

39
龙/木

+
24
羊/木

2026-03-04
063期
11
猴/火

21
狗/土

20
猪/土

23
猴/水

06
牛/土

05
虎/金

+
22
鸡/水

2026-03-03
062期
04
兔/金

26
蛇/金

12
羊/金

05
虎/金

11
猴/火

21
狗/土

+
17
虎/木

2026-03-02
061期
14
蛇/水

38
蛇/木

01
马/水

06
牛/土

13
马/金

48
羊/火

+
27
龙/金

2026-03-01
060期
49
马/火

43
鼠/金

10
鸡/火

05
虎/金

41
虎/火

35
猴/金

+
19
鼠/火

2026-02-28
059期
30
牛/水

21
狗/土

41
虎/火

37
马/土

28
兔/土

09
狗/木

+
24
羊/木

2026-02-27
058期
03
龙/火

39
龙/木

13
马/金

21
狗/土

20
猪/土

34
鸡/金

+
28
兔/土

2026-02-26
057期
30
牛/水

45
狗/水

02
蛇/火

14
蛇/水

47
猴/木

10
鸡/火

+
21
狗/土

2026-02-25
056期
46
鸡/木

36
羊/土

32
猪/火

10
鸡/火

28
兔/土

04
兔/金

+
06
牛/土

2026-02-24
055期
13
马/金

08
猪/木

22
鸡/水

30
牛/水

27
龙/金

14
蛇/水

+
47
猴/木

2026-02-23
054期
05
虎/金

49
马/火

04
兔/金

19
鼠/火

25
马/木

06
牛/土

+
21
狗/土

2026-02-22
053期
35
猴/金

24
羊/木

27
龙/金

13
马/金

19
鼠/火

03
龙/火

+
21
狗/土

2026-02-21
052期
14
蛇/水

18
牛/火

24
羊/木

22
鸡/水

31
鼠/水

26
蛇/金

+
28
兔/土

2026-02-20
051期
16
兔/木

19
鼠/火

23
猴/水

10
鸡/火

08
猪/木

01
马/水

+
06
牛/土

2026-02-19
050期
11
猴/火

37
马/土

19
鼠/火

28
兔/土

08
猪/木

38
蛇/木

+
44
猪/水

2026-02-18
049期
47
猴/木

48
羊/火

29
虎/土

27
龙/金

18
牛/火

15
龙/水

+
33
狗/火

2026-02-17
048期
30
牛/水

38
蛇/木

23
猴/水

14
蛇/水

17
虎/木

07
鼠/土

+
44
猪/水

2026-02-16
047期
41
牛/金

08
狗/木

20
狗/土

49
蛇/土

14
龙/水

43
猪/水

+
33
鸡/金

2026-02-15
046期
11
羊/金

24
马/木

31
猪/火

29
牛/水

04
虎/金

41
牛/金

+
38
龙/木

2026-02-14
045期
06
鼠/土

04
虎/金

42
鼠/金

45
鸡/木

02
龙/火

48
马/火

+
46
猴/木

2026-02-13
044期
38
龙/木

49
蛇/土

18
鼠/火

15
兔/木

17
牛/火

11
羊/金

+
40
虎/火

2026-02-12
043期
24
马/木

38
龙/木

28
虎/土

15
兔/木

31
猪/火

49
蛇/土

+
19
猪/土

2026-02-11
042期
25
蛇/金

24
马/木

16
虎/木

48
马/火

33
鸡/金

44
狗/水

+
42
鼠/金

2026-02-10
041期
46
猴/木

12
马/金

20
狗/土

13
蛇/水

28
虎/土

37
蛇/木

+
38
龙/木

2026-02-09
040期
19
猪/土

43
猪/水

05
牛/土

48
马/火

20
狗/土

31
猪/火

+
01
蛇/火

2026-02-08
039期
26
龙/金

20
狗/土

35
羊/土

45
鸡/木

36
马/土

14
龙/水

+
02
龙/火

2026-02-07
038期
05
牛/土

18
鼠/火

20
狗/土

34
猴/金

02
龙/火

45
鸡/木

+
26
龙/金

2026-02-06
037期
06
鼠/土

24
马/木

42
鼠/金

39
兔/火

15
兔/木

38
龙/木

+
46
猴/木

2026-02-05
036期
11
羊/金

24
马/木

09
鸡/火

17
牛/火

12
马/金

04
虎/金

+
44
狗/水

2026-02-04
035期
17
牛/火

42
鼠/金

48
马/火

04
虎/金

35
羊/土

02
龙/火

+
47
羊/火

2026-02-03
034期
45
鸡/木

37
蛇/木

41
牛/金

13
蛇/水

21
鸡/水

35
羊/土

+
34
猴/金

2026-02-02
033期
26
龙/金

11
羊/金

18
鼠/火

44
狗/水

06
鼠/土

02
龙/火

+
34
猴/金

2026-02-01
032期
01
蛇/火

48
马/火

19
猪/土

04
虎/金

39
兔/火

11
羊/金

+
37
蛇/木

2026-01-31
031期
08
狗/木

12
马/金

48
马/火

33
鸡/金

34
猴/金

10
猴/火

+
09
鸡/火

2026-01-30
030期
42
鼠/金

44
狗/水

49
蛇/土

08
狗/木

26
龙/金

17
牛/火

+
32
狗/火

2026-01-29
029期
41
牛/金

35
羊/土

33
鸡/金

40
虎/火

10
猴/火

07
猪/木

+
28
虎/土

2026-01-28
028期
09
鸡/火

36
马/土

38
龙/木

16
虎/木

01
蛇/火

18
鼠/火

+
49
蛇/土

2026-01-27
027期
41
牛/金

40
虎/火

16
虎/木

02
龙/火

29
牛/水

15
兔/木

+
06
鼠/土

2026-01-26
026期
09
鸡/火

31
猪/火

24
马/木

46
猴/木

32
狗/火

07
猪/木

+
23
羊/木

2026-01-25
025期
12
马/金

17
牛/火

04
虎/金

07
猪/木

38
龙/木

31
猪/火

+
47
羊/火

2026-01-24
024期
09
鸡/火

34
猴/金

08
狗/木

35
羊/土

46
猴/木

10
猴/火

+
38
龙/木

2026-01-23
023期
46
猴/木

32
狗/火

22
猴/水

41
牛/金

05
牛/土

30
鼠/水

+
08
狗/木

2026-01-22
022期
27
兔/土

41
牛/金

21
鸡/水

16
虎/木

19
猪/土

46
猴/木

+
40
虎/火

2026-01-21
021期
41
牛/金

24
马/木

30
鼠/水

23
羊/木

42
鼠/金

37
蛇/木

+
39
兔/火

2026-01-20
020期
26
龙/金

14
龙/水

03
兔/金

06
鼠/土

11
羊/金

29
牛/水

+
16
虎/木

2026-01-19
019期
37
蛇/木

25
蛇/金

13
蛇/水

28
虎/土

32
狗/火

47
羊/火

+
27
兔/土

2026-01-18
018期
07
猪/木

43
猪/水

12
马/金

17
牛/火

38
龙/木

11
羊/金

+
23
羊/木

2026-01-17
017期
14
龙/水

33
鸡/金

43
猪/水

32
狗/火

49
蛇/土

48
马/火

+
44
狗/水

2026-01-16
016期
18
鼠/火

47
羊/火

07
猪/木

01
蛇/火

19
猪/土

21
鸡/水

+
40
虎/火

2026-01-15
015期
28
虎/土

49
蛇/土

15
兔/木

24
马/木

06
鼠/土

26
龙/金

+
32
狗/火

2026-01-14
014期
25
蛇/金

42
鼠/金

14
龙/水

23
羊/木

48
马/火

36
马/土

+
30
鼠/水

2026-01-13
013期
21
鸡/水

45
鸡/木

08
狗/木

44
狗/水

24
马/木

29
牛/水

+
47
羊/火

2026-01-12
012期
43
猪/水

47
羊/火

16
虎/木

44
狗/水

19
猪/土

20
狗/土

+
28
虎/土

2026-01-11
011期
29
牛/水

46
猴/木

47
羊/火

49
蛇/土

14
龙/水

05
牛/土

+
42
鼠/金

2026-01-10
010期
09
鸡/火

05
牛/土

44
狗/水

49
蛇/土

36
马/土

34
猴/金

+
47
羊/火

2026-01-09
009期
32
狗/火

35
羊/土

23
羊/木

17
牛/火

22
猴/水

39
兔/火

+
30
鼠/水

2026-01-08
008期
36
马/土

39
兔/火

08
狗/木

43
猪/水

20
狗/土

32
狗/火

+
46
猴/木

2026-01-07
007期
43
猪/水

14
龙/水

27
兔/土

40
虎/火

36
马/土

12
马/金

+
33
鸡/金

2026-01-06
006期
34
猴/金

44
狗/水

01
蛇/火

33
鸡/金

18
鼠/火

39
兔/火

+
41
牛/金

2026-01-05
005期
07
猪/木

09
鸡/火

48
马/火

21
鸡/水

36
马/土

32
狗/火

+
19
猪/土

2026-01-04
004期
01
蛇/火

37
蛇/木

15
兔/木

40
虎/火

33
鸡/金

36
马/土

+
27
兔/土

2026-01-03
003期
39
兔/火

46
猴/木

03
兔/金

42
鼠/金

24
马/木

19
猪/土

+
20
狗/土

2026-01-02
002期
05
牛/土

12
马/金

18
鼠/火

46
猴/木

48
马/火

08
狗/木

+
19
猪/土

2026-01-01
001期
25
蛇/金

28
虎/土

34
猴/金

45
鸡/木

27
兔/土

40
虎/火

+
42
鼠/金

2025-12-31
365期
33
鸡/金

17
牛/火

23
羊/木

24
马/木

41
牛/金

38
龙/木

+
39
兔/火

2025-12-30
364期
24
马/木

17
牛/火

23
羊/木

43
猪/水

47
羊/火

46
猴/木

+
49
蛇/土

2025-12-29
363期
23
羊/木

31
猪/火

17
牛/火

14
龙/水

20
狗/土

19
猪/土

+
12
马/金

2025-12-28
362期
06
鼠/土

35
羊/土

14
龙/水

28
虎/土

16
虎/木

36
马/土

+
07
猪/木

2025-12-27
361期
16
虎/木

19
猪/土

20
狗/土

12
马/金

38
龙/木

07
猪/木

+
03
兔/金

2025-12-26
360期
05
牛/土

19
猪/土

17
牛/火

39
兔/火

46
猴/木

45
鸡/木

+
44
狗/水

2025-12-25
359期
46
猴/木

16
虎/木

18
鼠/火

47
羊/火

09
鸡/火

22
猴/水

+
02
龙/火

2025-12-24
358期
31
猪/火

49
蛇/土

28
虎/土

14
龙/水

09
鸡/火

43
猪/水

+
23
羊/木

2025-12-23
357期
05
牛/土

11
羊/金

27
兔/土

30
鼠/水

04
虎/金

43
猪/水

+
19
猪/土

2025-12-22
356期
09
鸡/火

48
马/火

46
猴/木

15
兔/木

34
猴/金

14
龙/水

+
18
鼠/火

2025-12-21
355期
03
兔/金

25
蛇/金

40
虎/火

35
羊/土

16
虎/木

22
猴/水

+
48
马/火

2025-12-20
354期
35
羊/土

32
狗/火

27
兔/土

04
虎/金

38
龙/木

08
狗/木

+
44
狗/水

2025-12-19
353期
40
虎/火

21
鸡/水

08
狗/木

16
虎/木

39
兔/火

02
龙/火

+
45
鸡/木

2025-12-18
352期
41
牛/金

35
羊/土

20
狗/土

43
猪/水

32
狗/火

24
马/木

+
23
羊/木

2025-12-17
351期
21
鸡/水

38
龙/木

31
猪/火

22
猴/水

27
兔/土

02
龙/火

+
45
鸡/木

2025-12-16
350期
28
虎/土

10
猴/火

07
猪/木

44
狗/水

06
鼠/土

43
猪/水

+
03
兔/金

2025-12-15
349期
17
牛/火

27
兔/土

04
虎/金

44
狗/水

13
蛇/水

45
鸡/木

+
18
鼠/火

2025-12-14
348期
19
猪/土

28
虎/土

36
马/土

10
猴/火

24
马/木

38
龙/木

+
17
牛/火

2025-12-13
347期
23
羊/木

25
蛇/金

19
猪/土

38
龙/木

31
猪/火

32
狗/火

+
33
鸡/金

2025-12-12
346期
03
兔/金

32
狗/火

08
狗/木

40
虎/火

47
羊/火

44
狗/水

+
43
猪/水

2025-12-11
345期
17
牛/火

31
猪/火

21
鸡/水

29
牛/水

48
马/火

27
兔/土

+
15
兔/木

2025-12-10
344期
21
鸡/水

03
兔/金

14
龙/水

05
牛/土

22
猴/水

02
龙/火

+
47
羊/火

2025-12-09
343期
15
兔/木

48
马/火

41
牛/金

17
牛/火

32
狗/火

45
鸡/木

+
10
猴/火

2025-12-08
342期
16
虎/木

15
兔/木

35
羊/土

09
鸡/火

36
马/土

01
蛇/火

+
37
蛇/木

2025-12-07
341期
01
蛇/火

29
牛/水

28
虎/土

41
牛/金

05
牛/土

08
狗/木

+
42
鼠/金

2025-12-06
340期
12
马/金

40
虎/火

27
兔/土

26
龙/金

47
羊/火

03
兔/金

+
29
牛/水

2025-12-05
339期
47
羊/火

02
龙/火

37
蛇/木

14
龙/水

01
蛇/火

04
虎/金

+
29
牛/水

2025-12-04
338期
49
蛇/土

47
羊/火

48
马/火

43
猪/水

15
兔/木

22
猴/水

+
36
马/土

2025-12-03
337期
02
龙/火

48
马/火

43
猪/水

36
马/土

49
蛇/土

29
牛/水

+
47
羊/火

2025-12-02
336期
28
虎/土

10
猴/火

26
龙/金

17
牛/火

06
鼠/土

11
羊/金

+
08
狗/木

2025-12-01
335期
08
狗/木

20
狗/土

37
蛇/木

46
猴/木

16
虎/木

41
牛/金

+
31
猪/火

2025-11-30
334期
28
虎/土

10
猴/火

16
虎/木

30
鼠/水

04
虎/金

27
兔/土

+
08
狗/木

2025-11-29
333期
43
猪/水

41
牛/金

06
鼠/土

38
龙/木

07
猪/木

34
猴/金

+
27
兔/土

2025-11-28
332期
35
羊/土

11
羊/金

32
狗/火

49
蛇/土

24
马/木

31
猪/火

+
36
马/土

2025-11-27
331期
18
鼠/火

37
蛇/木

07
猪/木

03
兔/金

05
牛/土

44
狗/水

+
09
鸡/火

2025-11-26
330期
05
牛/土

32
狗/火

06
鼠/土

01
蛇/火

26
龙/金

44
狗/水

+
43
猪/水

2025-11-25
329期
01
蛇/火

43
猪/水

11
羊/金

12
马/金

36
马/土

45
鸡/木

+
47
羊/火

2025-11-24
328期
38
龙/木

49
蛇/土

07
猪/木

23
羊/木

26
龙/金

18
鼠/火

+
13
蛇/水

2025-11-23
327期
02
龙/火

28
虎/土

25
蛇/金

27
兔/土

05
牛/土

15
兔/木

+
47
羊/火

2025-11-22
326期
14
龙/水

15
兔/木

22
猴/水

49
蛇/土

20
狗/土

37
蛇/木

+
07
猪/木

2025-11-21
325期
22
猴/水

31
猪/火

15
兔/木

14
龙/水

16
虎/木

01
蛇/火

+
13
蛇/水

2025-11-20
324期
18
鼠/火

47
羊/火

30
鼠/水

11
羊/金

33
鸡/金

21
鸡/水

+
43
猪/水

2025-11-19
323期
29
牛/水

27
兔/土

14
龙/水

32
狗/火

30
鼠/水

24
马/木

+
17
牛/火

2025-11-18
322期
11
羊/金

48
马/火

32
狗/火

17
牛/火

30
鼠/水

13
蛇/水

+
29
牛/水

2025-11-17
321期
05
牛/土

29
牛/水

30
鼠/水

21
鸡/水

32
狗/火

01
蛇/火

+
22
猴/水

2025-11-16
320期
20
狗/土

43
猪/水

05
牛/土

24
马/木

01
蛇/火

35
羊/土

+
42
鼠/金

2025-11-15
319期
30
鼠/水

23
羊/木

32
狗/火

20
狗/土

36
马/土

04
虎/金

+
05
牛/土

2025-11-14
318期
30
鼠/水

20
狗/土

07
猪/木

28
虎/土

26
龙/金

47
羊/火

+
08
狗/木

2025-11-13
317期
16
虎/木

33
鸡/金

11
羊/金

04
虎/金

17
牛/火

43
猪/水

+
24
马/木

2025-11-12
316期
01
蛇/火

15
兔/木

14
龙/水

20
狗/土

48
马/火

11
羊/金

+
18
鼠/火

2025-11-11
315期
45
鸡/木

33
鸡/金

03
兔/金

21
鸡/水

48
马/火

41
牛/金

+
15
兔/木

2025-11-10
314期
05
牛/土

40
虎/火

47
羊/火

01
蛇/火

08
狗/木

29
牛/水

+
24
马/木

2025-11-09
313期
31
猪/火

11
羊/金

41
牛/金

46
猴/木

19
猪/土

39
兔/火

+
18
鼠/火

2025-11-08
312期
06
鼠/土

03
兔/金

48
马/火

42
鼠/金

45
鸡/木

21
鸡/水

+
36
马/土

2025-11-07
311期
21
鸡/水

01
蛇/火

17
牛/火

36
马/土

38
龙/木

46
猴/木

+
40
虎/火

2025-11-06
310期
39
兔/火

30
鼠/水

01
蛇/火

17
牛/火

27
兔/土

38
龙/木

+
37
蛇/木

2025-11-05
309期
21
鸡/水

12
马/金

04
虎/金

25
蛇/金

41
牛/金

13
蛇/水

+
49
蛇/土

2025-11-04
308期
13
蛇/水

07
猪/木

09
鸡/火

49
蛇/土

27
兔/土

33
鸡/金

+
18
鼠/火

2025-11-03
307期
18
鼠/火

08
狗/木

07
猪/木

20
狗/土

41
牛/金

23
羊/木

+
22
猴/水

2025-11-02
306期
27
兔/土

11
羊/金

30
鼠/水

39
兔/火

07
猪/木

05
牛/土

+
31
猪/火

2025-11-01
305期
17
牛/火

32
狗/火

49
蛇/土

10
猴/火

34
猴/金

07
猪/木

+
16
虎/木

2025-10-31
304期
30
鼠/水

28
虎/土

34
猴/金

29
牛/水

27
兔/土

35
羊/土

+
10
猴/火

2025-10-30
303期
25
蛇/金

15
兔/木

08
狗/木

21
鸡/水

46
猴/木

41
牛/金

+
33
鸡/金

2025-10-29
302期
35
羊/土

20
狗/土

33
鸡/金

29
牛/水

40
虎/火

31
猪/火

+
06
鼠/土

2025-10-28
301期
28
虎/土

03
兔/金

44
狗/水

16
虎/木

01
蛇/火

49
蛇/土

+
18
鼠/火

2025-10-27
300期
06
鼠/土

04
虎/金

13
蛇/水

01
蛇/火

37
蛇/木

41
牛/金

+
16
虎/木

2025-10-26
299期
43
猪/水

03
兔/金

07
猪/木

19
猪/土

39
兔/火

40
虎/火

+
48
马/火

2025-10-25
298期
37
蛇/木

33
鸡/金

20
狗/土

44
狗/水

41
牛/金

03
兔/金

+
29
牛/水

2025-10-24
297期
10
猴/火

05
牛/土

02
龙/火

15
兔/木

46
猴/木

34
猴/金

+
36
马/土

2025-10-23
296期
38
龙/木

07
猪/木

18
鼠/火

12
马/金

49
蛇/土

05
牛/土

+
13
蛇/水

2025-10-22
295期
20
狗/土

28
虎/土

33
鸡/金

49
蛇/土

18
鼠/火

15
兔/木

+
05
牛/土

2025-10-21
294期
02
龙/火

23
羊/木

30
鼠/水

42
鼠/金

14
龙/水

29
牛/水

+
15
兔/木

2025-10-20
293期
08
狗/木

37
蛇/木

12
马/金

45
鸡/木

29
牛/水

22
猴/水

+
48
马/火

2025-10-19
292期
05
牛/土

12
马/金

18
鼠/火

30
鼠/水

14
龙/水

06
鼠/土

+
22
猴/水

2025-10-18
291期
17
牛/火

38
龙/木

14
龙/水

46
猴/木

45
鸡/木

49
蛇/土

+
39
兔/火

2025-10-17
290期
44
狗/水

14
龙/水

17
牛/火

13
蛇/水

05
牛/土

43
猪/水

+
34
猴/金

2025-10-16
289期
05
牛/土

27
兔/土

48
马/火

03
兔/金

01
蛇/火

33
鸡/金

+
24
马/木

2025-10-15
288期
46
猴/木

21
鸡/水

26
龙/金

24
马/木

27
兔/土

09
鸡/火

+
01
蛇/火

2025-10-14
287期
03
兔/金

42
鼠/金

43
猪/水

24
马/木

32
狗/火

47
羊/火

+
04
虎/金

2025-10-13
286期
11
羊/金

01
蛇/火

42
鼠/金

33
鸡/金

17
牛/火

23
羊/木

+
48
马/火

2025-10-12
285期
03
兔/金

26
龙/金

14
龙/水

44
狗/水

11
羊/金

42
鼠/金

+
06
鼠/土

2025-10-11
284期
14
龙/水

49
蛇/土

44
狗/水

07
猪/木

05
牛/土

34
猴/金

+
20
狗/土

2025-10-10
283期
19
猪/土

42
鼠/金

22
猴/水

44
狗/水

27
兔/土

25
蛇/金

+
18
鼠/火

2025-10-09
282期
27
兔/土

10
猴/火

28
虎/土

36
马/土

05
牛/土

47
羊/火

+
34
猴/金

2025-10-08
281期
05
牛/土

01
蛇/火

25
蛇/金

44
狗/水

06
鼠/土

48
马/火

+
43
猪/水

2025-10-07
280期
43
猪/水

49
蛇/土

28
虎/土

12
马/金

11
羊/金

41
牛/金

+
20
狗/土

2025-10-06
279期
10
猴/火

09
鸡/火

25
蛇/金

32
狗/火

42
鼠/金

17
牛/火

+
04
虎/金

2025-10-05
278期
45
鸡/木

47
羊/火

03
兔/金

29
牛/水

10
猴/火

37
蛇/木

+
41
牛/金

2025-10-04
277期
11
羊/金

02
龙/火

03
兔/金

31
猪/火

08
狗/木

24
马/木

+
47
羊/火

2025-10-03
276期
33
鸡/金

23
羊/木

06
鼠/土

31
猪/火

03
兔/金

43
猪/水

+
01
蛇/火

2025-10-02
275期
22
猴/水

08
狗/木

45
鸡/木

33
鸡/金

07
猪/木

17
牛/火

+
31
猪/火

2025-10-01
274期
21
鸡/水

49
蛇/土

08
狗/木

44
狗/水

38
龙/木

31
猪/火

+
24
马/木

2025-09-30
273期
27
兔/土

20
狗/土

44
狗/水

49
蛇/土

15
兔/木

31
猪/火

+
05
牛/土

2025-09-29
272期
46
猴/木

37
蛇/木

05
牛/土

22
猴/水

26
龙/金

27
兔/土

+
23
羊/木

2025-09-28
271期
06
鼠/土

09
鸡/火

23
羊/木

47
羊/火

29
牛/水

07
猪/木

+
26
龙/金

2025-09-27
270期
16
虎/木

47
羊/火

07
猪/木

32
狗/火

22
猴/水

23
羊/木

+
44
狗/水

2025-09-26
269期
48
马/火

09
鸡/火

46
猴/木

07
猪/木

06
鼠/土

38
龙/木

+
37
蛇/木

2025-09-25
268期
14
龙/水

06
鼠/土

31
猪/火

38
龙/木

47
羊/火

42
鼠/金

+
32
狗/火

2025-09-24
267期
49
蛇/土

12
马/金

44
狗/水

24
马/木

03
兔/金

27
兔/土

+
22
猴/水

2025-09-23
266期
48
马/火

35
羊/土

44
狗/水

45
鸡/木

03
兔/金

10
猴/火

+
40
虎/火

2025-09-22
265期
44
狗/水

12
马/金

22
猴/水

36
马/土

42
鼠/金

49
蛇/土

+
30
鼠/水

2025-09-21
264期
01
蛇/火

28
虎/土

24
马/木

15
兔/木

02
龙/火

35
羊/土

+
27
兔/土

2025-09-20
263期
29
牛/水

36
马/土

10
猴/火

19
猪/土

28
虎/土

12
马/金

+
34
猴/金

2025-09-19
262期
08
狗/木

14
龙/水

16
虎/木

04
虎/金

35
羊/土

23
羊/木

+
03
兔/金

2025-09-18
261期
16
虎/木

22
猴/水

45
鸡/木

29
牛/水

20
狗/土

46
猴/木

+
49
蛇/土

2025-09-17
260期
42
鼠/金

12
马/金

07
猪/木

02
龙/火

16
虎/木

13
蛇/水

+
25
蛇/金

2025-09-16
259期
48
马/火

04
虎/金

11
羊/金

25
蛇/金

01
蛇/火

46
猴/木

+
45
鸡/木

2025-09-15
258期
29
牛/水

48
马/火

45
鸡/木

06
鼠/土

37
蛇/木

18
鼠/火

+
12
马/金

2025-09-14
257期
38
龙/木

33
鸡/金

14
龙/水

12
马/金

21
鸡/水

31
猪/火

+
48
马/火

2025-09-13
256期
20
狗/土

12
马/金

18
鼠/火

45
鸡/木

04
虎/金

36
马/土

+
35
羊/土

2025-09-12
255期
47
羊/火

14
龙/水

39
兔/火

11
羊/金

28
虎/土

06
鼠/土

+
33
鸡/金

2025-09-11
254期
14
龙/水

29
牛/水

48
马/火

35
羊/土

16
虎/木

01
蛇/火

+
13
蛇/水

2025-09-10
253期
24
马/木

11
羊/金

40
虎/火

15
兔/木

05
牛/土

38
龙/木

+
19
猪/土

2025-09-09
252期
14
龙/水

04
虎/金

27
兔/土

20
狗/土

05
牛/土

10
猴/火

+
24
马/木

2025-09-08
251期
22
猴/水

42
鼠/金

01
蛇/火

33
鸡/金

44
狗/水

35
羊/土

+
41
牛/金

2025-09-07
250期
47
羊/火

06
鼠/土

31
猪/火

22
猴/水

23
羊/木

21
鸡/水

+
04
虎/金

2025-09-06
249期
03
兔/金

46
猴/木

06
鼠/土

04
虎/金

20
狗/土

09
鸡/火

+
02
龙/火

2025-09-05
248期
07
猪/木

18
鼠/火

24
马/木

25
蛇/金

27
兔/土

12
马/金

+
15
兔/木

2025-09-04
247期
08
狗/木

25
蛇/金

28
虎/土

36
马/土

13
蛇/水

41
牛/金

+
29
牛/水

2025-09-03
246期
21
鸡/水

32
狗/火

12
马/金

15
兔/木

03
兔/金

49
蛇/土

+
16
虎/木

2025-09-02
245期
15
兔/木

04
虎/金

08
狗/木

26
龙/金

10
猴/火

06
鼠/土

+
39
兔/火

2025-09-01
244期
41
牛/金

26
龙/金

27
兔/土

44
狗/水

40
虎/火

39
兔/火

+
24
马/木

2025-08-31
243期
17
牛/火

29
牛/水

47
羊/火

09
鸡/火

02
龙/火

25
蛇/金

+
48
马/火

2025-08-30
242期
19
猪/土

15
兔/木

21
鸡/水

40
虎/火

42
鼠/金

49
蛇/土

+
16
虎/木

2025-08-29
241期
25
蛇/金

41
牛/金

23
羊/木

13
蛇/水

29
牛/水

04
虎/金

+
43
猪/水

2025-08-28
240期
37
蛇/木

32
狗/火

48
马/火

19
猪/土

36
马/土

25
蛇/金

+
42
鼠/金

2025-08-27
239期
05
牛/土

48
马/火

33
鸡/金

08
狗/木

37
蛇/木

20
狗/土

+
36
马/土

2025-08-26
238期
35
羊/土

10
猴/火

20
狗/土

34
猴/金

36
马/土

31
猪/火

+
12
马/金

2025-08-25
237期
29
牛/水

47
羊/火

14
龙/水

06
鼠/土

23
羊/木

43
猪/水

+
46
猴/木

2025-08-24
236期
11
羊/金

32
狗/火

04
虎/金

26
龙/金

41
牛/金

25
蛇/金

+
43
猪/水

2025-08-23
235期
32
狗/火

05
牛/土

01
蛇/火

18
鼠/火

33
鸡/金

44
狗/水

+
21
鸡/水

2025-08-22
234期
17
牛/火

19
猪/土

28
虎/土

33
鸡/金

10
猴/火

44
狗/水

+
29
牛/水

2025-08-21
233期
40
虎/火

32
狗/火

31
猪/火

48
马/火

44
狗/水

16
虎/木

+
27
兔/土

2025-08-20
232期
12
马/金

29
牛/水

14
龙/水

07
猪/木

19
猪/土

13
蛇/水

+
46
猴/木

2025-08-19
231期
36
马/土

31
猪/火

34
猴/金

04
虎/金

38
龙/木

40
虎/火

+
33
鸡/金

2025-08-18
230期
40
虎/火

06
鼠/土

39
兔/火

07
猪/木

21
鸡/水

48
马/火

+
32
狗/火

2025-08-17
229期
41
牛/金

30
鼠/水

45
鸡/木

19
猪/土

35
羊/土

15
兔/木

+
28
虎/土

2025-08-16
228期
36
马/土

40
虎/火

31
猪/火

04
虎/金

29
牛/水

34
猴/金

+
11
羊/金

2025-08-15
227期
34
猴/金

32
狗/火

10
猴/火

17
牛/火

41
牛/金

31
猪/火

+
19
猪/土

2025-08-14
226期
11
羊/金

43
猪/水

48
马/火

17
牛/火

22
猴/水

08
狗/木

+
37
蛇/木

2025-08-13
225期
39
兔/火

16
虎/木

40
虎/火

20
狗/土

18
鼠/火

28
虎/土

+
42
鼠/金

2025-08-12
224期
35
羊/土

14
龙/水

02
龙/火

22
猴/水

06
鼠/土

05
牛/土

+
15
兔/木

2025-08-11
223期
23
羊/木

21
鸡/水

04
虎/金

35
羊/土

42
鼠/金

41
牛/金

+
10
猴/火

2025-08-10
222期
02
龙/火

45
鸡/木

43
猪/水

41
牛/金

39
兔/火

31
猪/火

+
20
狗/土

2025-08-09
221期
42
鼠/金

27
兔/土

37
蛇/木

09
鸡/火

25
蛇/金

43
猪/水

+
28
虎/土

2025-08-08
220期
39
兔/火

18
鼠/火

06
鼠/土

22
猴/水

07
猪/木

24
马/木

+
40
虎/火

2025-08-07
219期
20
狗/土

45
鸡/木

34
猴/金

23
羊/木

13
蛇/水

39
兔/火

+
08
狗/木

2025-08-06
218期
16
虎/木

21
鸡/水

26
龙/金

37
蛇/木

30
鼠/水

40
虎/火

+
17
牛/火

2025-08-05
217期
27
兔/土

40
虎/火

05
牛/土

36
马/土

22
猴/水

04
虎/金

+
37
蛇/木

2025-08-04
216期
22
猴/水

19
猪/土

13
蛇/水

12
马/金

01
蛇/火

20
狗/土

+
05
牛/土

2025-08-03
215期
11
羊/金

07
猪/木

14
龙/水

49
蛇/土

33
鸡/金

21
鸡/水

+
01
蛇/火

2025-08-02
214期
24
马/木

19
猪/土

20
狗/土

29
牛/水

45
鸡/木

33
鸡/金

+
36
马/土

2025-08-01
213期
34
猴/金

11
羊/金

47
羊/火

21
鸡/水

25
蛇/金

45
鸡/木

+
31
猪/火

2025-07-31
212期
18
鼠/火

25
蛇/金

29
牛/水

23
羊/木

32
狗/火

36
马/土

+
27
兔/土

2025-07-30
211期
23
羊/木

44
狗/水

39
兔/火

46
猴/木

14
龙/水

35
羊/土

+
03
兔/金

2025-07-29
210期
35
羊/土

22
猴/水

11
羊/金

47
羊/火

46
猴/木

07
猪/木

+
06
鼠/土

2025-07-28
209期
28
虎/土

24
马/木

12
马/金

31
猪/火

08
狗/木

48
马/火

+
49
蛇/土

2025-07-27
208期
41
牛/金

06
鼠/土

25
蛇/金

47
羊/火

27
兔/土

43
猪/水

+
26
龙/金

2025-07-26
207期
33
鸡/金

28
虎/土

15
兔/木

01
蛇/火

39
兔/火

30
鼠/水

+
38
龙/木

2025-07-25
206期
18
鼠/火

02
龙/火

03
兔/金

10
猴/火

16
虎/木

20
狗/土

+
06
鼠/土

2025-07-24
205期
16
虎/木

34
猴/金

01
蛇/火

18
鼠/火

29
牛/水

05
牛/土

+
28
虎/土

2025-07-23
204期
30
鼠/水

05
牛/土

23
羊/木

22
猴/水

37
蛇/木

40
虎/火

+
18
鼠/火

2025-07-22
203期
36
马/土

38
龙/木

18
鼠/火

33
鸡/金

44
狗/水

20
狗/土

+
11
羊/金

2025-07-21
202期
09
鸡/火

12
马/金

32
狗/火

27
兔/土

10
猴/火

17
牛/火

+
25
蛇/金

2025-07-20
201期
17
牛/火

32
狗/火

11
羊/金

03
兔/金

29
牛/水

22
猴/水

+
18
鼠/火

2025-07-19
200期
47
羊/火

26
龙/金

03
兔/金

32
狗/火

18
鼠/火

19
猪/土

+
35
羊/土

2025-07-18
199期
06
鼠/土

22
猴/水

11
羊/金

13
蛇/水

39
兔/火

04
虎/金

+
20
狗/土

2025-07-17
198期
12
马/金

05
牛/土

32
狗/火

26
龙/金

42
鼠/金

45
鸡/木

+
27
兔/土

2025-07-16
197期
44
狗/水

37
蛇/木

36
马/土

22
猴/水

07
猪/木

28
虎/土

+
04
虎/金

2025-07-15
196期
09
鸡/火

48
马/火

44
狗/水

17
牛/火

33
鸡/金

05
牛/土

+
18
鼠/火

2025-07-14
195期
09
鸡/火

27
兔/土

07
猪/木

33
鸡/金

03
兔/金

23
羊/木

+
19
猪/土

2025-07-13
194期
42
鼠/金

08
狗/木

13
蛇/水

11
羊/金

22
猴/水

18
鼠/火

+
38
龙/木

2025-07-12
193期
11
羊/金

34
猴/金

20
狗/土

17
牛/火

27
兔/土

31
猪/火

+
03
兔/金

2025-07-11
192期
22
猴/水

37
蛇/木

02
龙/火

12
马/金

16
虎/木

03
兔/金

+
10
猴/火

2025-07-10
191期
49
蛇/土

30
鼠/水

22
猴/水

45
鸡/木

43
猪/水

42
鼠/金

+
15
兔/木

2025-07-09
190期
48
马/火

47
羊/火

23
羊/木

33
鸡/金

02
龙/火

08
狗/木

+
11
羊/金

2025-07-08
189期
16
虎/木

34
猴/金

40
虎/火

43
猪/水

09
鸡/火

37
蛇/木

+
25
蛇/金

2025-07-07
188期
04
虎/金

20
狗/土

40
虎/火

05
牛/土

11
羊/金

39
兔/火

+
16
虎/木

2025-07-06
187期
10
猴/火

49
蛇/土

04
虎/金

21
鸡/水

12
马/金

06
鼠/土

+
37
蛇/木

2025-07-05
186期
25
蛇/金

23
羊/木

43
猪/水

12
马/金

08
狗/木

35
羊/土

+
06
鼠/土

2025-07-04
185期
05
牛/土

29
牛/水

32
狗/火

04
虎/金

41
牛/金

42
鼠/金

+
33
鸡/金

2025-07-03
184期
33
鸡/金

47
羊/火

19
猪/土

03
兔/金

25
蛇/金

44
狗/水

+
31
猪/火

2025-07-02
183期
30
鼠/水

24
马/木

46
猴/木

02
龙/火

04
虎/金

06
鼠/土

+
41
牛/金

2025-07-01
182期
03
兔/金

27
兔/土

24
马/木

42
鼠/金

25
蛇/金

04
虎/金

+
09
鸡/火

2025-06-30
181期
46
猴/木

30
鼠/水

23
羊/木

06
鼠/土

43
猪/水

15
兔/木

+
49
蛇/土

2025-06-29
180期
44
狗/水

18
鼠/火

29
牛/水

11
羊/金

13
蛇/水

26
龙/金

+
03
兔/金

2025-06-28
179期
02
龙/火

06
鼠/土

42
鼠/金

31
猪/火

17
牛/火

13
蛇/水

+
27
兔/土

2025-06-27
178期
32
狗/火

15
兔/木

25
蛇/金

03
兔/金

35
羊/土

45
鸡/木

+
48
马/火

2025-06-26
177期
02
龙/火

06
鼠/土

32
狗/火

33
鸡/金

07
猪/木

10
猴/火

+
39
兔/火

2025-06-25
176期
04
虎/金

01
蛇/火

27
兔/土

02
龙/火

40
虎/火

12
马/金

+
35
羊/土

2025-06-24
175期
49
蛇/土

14
龙/水

43
猪/水

12
马/金

40
虎/火

03
兔/金

+
35
羊/土

2025-06-23
174期
19
猪/土

13
蛇/水

33
鸡/金

41
牛/金

34
猴/金

45
鸡/木

+
07
猪/木

2025-06-22
173期
42
鼠/金

17
牛/火

09
鸡/火

10
猴/火

28
虎/土

25
蛇/金

+
22
猴/水

2025-06-21
172期
17
牛/火

14
龙/水

46
猴/木

47
羊/火

19
猪/土

12
马/金

+
11
羊/金

2025-06-20
171期
09
鸡/火

04
虎/金

20
狗/土

35
羊/土

43
猪/水

47
羊/火

+
37
蛇/木

2025-06-19
170期
35
羊/土

10
猴/火

38
龙/木

17
牛/火

31
猪/火

20
狗/土

+
09
鸡/火

2025-06-18
169期
32
狗/火

12
马/金

47
羊/火

36
马/土

28
虎/土

19
猪/土

+
40
虎/火

2025-06-17
168期
43
猪/水

37
蛇/木

47
羊/火

25
蛇/金

45
鸡/木

19
猪/土

+
17
牛/火

2025-06-16
167期
46
猴/木

47
羊/火

16
虎/木

30
鼠/水

06
鼠/土

37
蛇/木

+
26
龙/金

2025-06-15
166期
03
兔/金

04
虎/金

23
羊/木

02
龙/火

43
猪/水

11
羊/金

+
40
虎/火

2025-06-14
165期
42
鼠/金

28
虎/土

39
兔/火

41
牛/金

23
羊/木

01
蛇/火

+
16
虎/木

2025-06-13
164期
20
狗/土

40
虎/火

09
鸡/火

32
狗/火

43
猪/水

48
马/火

+
49
蛇/土

2025-06-12
163期
15
兔/木

36
马/土

44
狗/水

17
牛/火

07
猪/木

02
龙/火

+
46
猴/木

2025-06-11
162期
32
狗/火

10
猴/火

15
兔/木

49
蛇/土

06
鼠/土

14
龙/水

+
48
马/火

2025-06-10
161期
42
鼠/金

37
蛇/木

03
兔/金

32
狗/火

01
蛇/火

24
马/木

+
05
牛/土

2025-06-09
160期
25
蛇/金

49
蛇/土

42
鼠/金

11
羊/金

48
马/火

20
狗/土

+
18
鼠/火

2025-06-08
159期
30
鼠/水

21
鸡/水

13
蛇/水

24
马/木

07
猪/木

18
鼠/火

+
25
蛇/金

2025-06-07
158期
24
马/木

01
蛇/火

30
鼠/水

36
马/土

20
狗/土

43
猪/水

+
02
龙/火

2025-06-06
157期
49
蛇/土

36
马/土

26
龙/金

40
虎/火

21
鸡/水

25
蛇/金

+
32
狗/火

2025-06-05
156期
37
蛇/木

08
狗/木

44
狗/水

19
猪/土

41
牛/金

10
猴/火

+
07
猪/木

2025-06-04
155期
42
鼠/金

01
蛇/火

21
鸡/水

15
兔/木

36
马/土

47
羊/火

+
05
牛/土

2025-06-03
154期
44
狗/水

31
猪/火

45
鸡/木

04
虎/金

05
牛/土

09
鸡/火

+
19
猪/土

2025-06-02
153期
07
猪/木

27
兔/土

43
猪/水

05
牛/土

04
虎/金

38
龙/木

+
20
狗/土

2025-06-01
152期
43
猪/水

21
鸡/水

33
鸡/金

13
蛇/水

19
猪/土

17
牛/火

+
35
羊/土

2025-05-31
151期
10
猴/火

04
虎/金

21
鸡/水

46
猴/木

35
羊/土

22
猴/水

+
33
鸡/金

2025-05-30
150期
24
马/木

43
猪/水

17
牛/火

49
蛇/土

14
龙/水

22
猴/水

+
36
马/土

2025-05-29
149期
34
猴/金

18
鼠/火

14
龙/水

30
鼠/水

47
羊/火

44
狗/水

+
46
猴/木

2025-05-28
148期
45
鸡/木

24
马/木

40
虎/火

49
蛇/土

13
蛇/水

01
蛇/火

+
33
鸡/金

2025-05-27
147期
37
蛇/木

26
龙/金

45
鸡/木

46
猴/木

31
猪/火

04
虎/金

+
18
鼠/火

2025-05-26
146期
03
兔/金

04
虎/金

45
鸡/木

19
猪/土

16
虎/木

41
牛/金

+
09
鸡/火

2025-05-25
145期
44
狗/水

07
猪/木

38
龙/木

18
鼠/火

25
蛇/金

02
龙/火

+
08
狗/木

2025-05-24
144期
20
狗/土

28
虎/土

19
猪/土

31
猪/火

46
猴/木

48
马/火

+
33
鸡/金

2025-05-23
143期
04
虎/金

18
鼠/火

33
鸡/金

45
鸡/木

03
兔/金

19
猪/土

+
29
牛/水

2025-05-22
142期
11
羊/金

22
猴/水

28
虎/土

36
马/土

01
蛇/火

46
猴/木

+
38
龙/木

2025-05-21
141期
20
狗/土

37
蛇/木

16
虎/木

05
牛/土

06
鼠/土

23
羊/木

+
14
龙/水

2025-05-20
140期
02
龙/火

26
龙/金

29
牛/水

48
马/火

19
猪/土

17
牛/火

+
32
狗/火

2025-05-19
139期
31
猪/火

26
龙/金

09
鸡/火

25
蛇/金

04
虎/金

07
猪/木

+
47
羊/火

2025-05-18
138期
11
羊/金

41
牛/金

28
虎/土

05
牛/土

03
兔/金

02
龙/火

+
38
龙/木

2025-05-17
137期
09
鸡/火

42
鼠/金

39
兔/火

25
蛇/金

16
虎/木

29
牛/水

+
38
龙/木

2025-05-16
136期
12
马/金

29
牛/水

10
猴/火

23
羊/木

21
鸡/水

46
猴/木

+
37
蛇/木

2025-05-15
135期
22
猴/水

31
猪/火

17
牛/火

03
兔/金

25
蛇/金

10
猴/火

+
11
羊/金

2025-05-14
134期
48
马/火

45
鸡/木

22
猴/水

37
蛇/木

46
猴/木

08
狗/木

+
18
鼠/火

2025-05-13
133期
12
马/金

30
鼠/水

49
蛇/土

45
鸡/木

16
虎/木

25
蛇/金

+
18
鼠/火

2025-05-12
132期
07
猪/木

27
兔/土

32
狗/火

01
蛇/火

44
狗/水

26
龙/金

+
02
龙/火

2025-05-11
131期
33
鸡/金

18
鼠/火

01
蛇/火

05
牛/土

27
兔/土

21
鸡/水

+
23
羊/木

2025-05-10
130期
30
鼠/水

40
虎/火

13
蛇/水

08
狗/木

16
虎/木

25
蛇/金

+
42
鼠/金

2025-05-09
129期
02
龙/火

13
蛇/水

07
猪/木

03
兔/金

31
猪/火

43
猪/水

+
20
狗/土

2025-05-08
128期
06
鼠/土

39
兔/火

02
龙/火

11
羊/金

01
蛇/火

35
羊/土

+
05
牛/土

2025-05-07
127期
25
蛇/金

31
猪/火

39
兔/火

49
蛇/土

48
马/火

19
猪/土

+
34
猴/金

2025-05-06
126期
15
兔/木

06
鼠/土

04
虎/金

05
牛/土

48
马/火

07
猪/木

+
39
兔/火

2025-05-05
125期
35
羊/土

37
蛇/木

29
牛/水

03
兔/金

18
鼠/火

47
羊/火

+
49
蛇/土

2025-05-04
124期
38
龙/木

01
蛇/火

17
牛/火

21
鸡/水

13
蛇/水

08
狗/木

+
12
马/金

2025-05-03
123期
48
马/火

39
兔/火

34
猴/金

22
猴/水

14
龙/水

42
鼠/金

+
46
猴/木

2025-05-02
122期
13
蛇/水

15
兔/木

22
猴/水

45
鸡/木

08
狗/木

10
猴/火

+
43
猪/水

2025-05-01
121期
46
猴/木

22
猴/水

29
牛/水

28
虎/土

31
猪/火

15
兔/木

+
08
狗/木

2025-04-30
120期
43
猪/水

09
鸡/火

32
狗/火

11
羊/金

41
牛/金

17
牛/火

+
37
蛇/木

2025-04-29
119期
16
虎/木

27
兔/土

44
狗/水

11
羊/金

18
鼠/火

42
鼠/金

+
48
马/火

2025-04-28
118期
19
猪/土

16
虎/木

35
羊/土

41
牛/金

47
羊/火

03
兔/金

+
33
鸡/金

2025-04-27
117期
09
鸡/火

14
龙/水

36
马/土

41
牛/金

37
蛇/木

29
牛/水

+
28
虎/土

2025-04-26
116期
41
牛/金

28
虎/土

30
鼠/水

47
羊/火

42
鼠/金

08
狗/木

+
49
蛇/土

2025-04-25
115期
36
马/土

01
蛇/火

40
虎/火

26
龙/金

39
兔/火

23
羊/木

+
48
马/火

2025-04-24
114期
43
猪/水

25
蛇/金

38
龙/木

47
羊/火

46
猴/木

02
龙/火

+
26
龙/金

2025-04-23
113期
44
狗/水

04
虎/金

40
虎/火

08
狗/木

28
虎/土

31
猪/火

+
05
牛/土

2025-04-22
112期
17
牛/火

15
兔/木

31
猪/火

48
马/火

21
鸡/水

07
猪/木

+
01
蛇/火

2025-04-21
111期
36
马/土

04
虎/金

05
牛/土

41
牛/金

17
牛/火

27
兔/土

+
28
虎/土

2025-04-20
110期
32
狗/火

02
龙/火

25
蛇/金

37
蛇/木

24
马/木

35
羊/土

+
30
鼠/水

2025-04-19
109期
28
虎/土

29
牛/水

24
马/木

13
蛇/水

16
虎/木

07
猪/木

+
22
猴/水

2025-04-18
108期
13
蛇/水

14
龙/水

20
狗/土

24
马/木

19
猪/土

40
虎/火

+
26
龙/金

2025-04-17
107期
02
龙/火

25
蛇/金

19
猪/土

20
狗/土

13
蛇/水

33
鸡/金

+
07
猪/木

2025-04-16
106期
08
狗/木

17
牛/火

46
猴/木

24
马/木

28
虎/土

33
鸡/金

+
43
猪/水

2025-04-15
105期
49
蛇/土

24
马/木

44
狗/水

25
蛇/金

34
猴/金

09
鸡/火

+
26
龙/金

2025-04-14
104期
48
马/火

39
兔/火

20
狗/土

41
牛/金

02
龙/火

28
虎/土

+
26
龙/金

2025-04-13
103期
04
虎/金

34
猴/金

11
羊/金

38
龙/木

47
羊/火

45
鸡/木

+
39
兔/火

2025-04-12
102期
18
鼠/火

06
鼠/土

20
狗/土

46
猴/木

11
羊/金

43
猪/水

+
17
牛/火

2025-04-11
101期
29
牛/水

01
蛇/火

08
狗/木

43
猪/水

04
虎/金

31
猪/火

+
22
猴/水

2025-04-10
100期
40
虎/火

44
狗/水

01
蛇/火

19
猪/土

26
龙/金

10
猴/火

+
42
鼠/金

2025-04-09
099期
42
鼠/金

41
牛/金

25
蛇/金

28
虎/土

49
蛇/土

07
猪/木

+
18
鼠/火

2025-04-08
098期
26
龙/金

46
猴/木

28
虎/土

06
鼠/土

34
猴/金

10
猴/火

+
21
鸡/水

2025-04-07
097期
11
羊/金

29
牛/水

04
虎/金

10
猴/火

34
猴/金

05
牛/土

+
25
蛇/金

2025-04-06
096期
30
鼠/水

49
蛇/土

23
羊/木

02
龙/火

32
狗/火

34
猴/金

+
16
虎/木

2025-04-05
095期
16
虎/木

40
虎/火

08
狗/木

49
蛇/土

11
羊/金

35
羊/土

+
03
兔/金

2025-04-04
094期
44
狗/水

42
鼠/金

20
狗/土

01
蛇/火

17
牛/火

41
牛/金

+
16
虎/木

2025-04-03
093期
48
马/火

33
鸡/金

06
鼠/土

30
鼠/水

20
狗/土

18
鼠/火

+
32
狗/火

2025-04-02
092期
49
蛇/土

20
狗/土

15
兔/木

08
狗/木

48
马/火

27
兔/土

+
11
羊/金

2025-04-01
091期
33
鸡/金

36
马/土

10
猴/火

20
狗/土

09
鸡/火

46
猴/木

+
15
兔/木

2025-03-31
090期
25
蛇/金

29
牛/水

14
龙/水

01
蛇/火

09
鸡/火

32
狗/火

+
30
鼠/水

2025-03-30
089期
14
龙/水

31
猪/火

23
羊/木

49
蛇/土

20
狗/土

43
猪/水

+
15
兔/木

2025-03-29
088期
47
羊/火

16
虎/木

34
猴/金

32
狗/火

48
马/火

20
狗/土

+
02
龙/火

2025-03-28
087期
08
狗/木

12
马/金

20
狗/土

40
虎/火

46
猴/木

31
猪/火

+
43
猪/水

2025-03-27
086期
16
虎/木

19
猪/土

45
鸡/木

09
鸡/火

05
牛/土

14
龙/水

+
47
羊/火

2025-03-26
085期
46
猴/木

29
牛/水

30
鼠/水

18
鼠/火

10
猴/火

14
龙/水

+
33
鸡/金

2025-03-25
084期
31
猪/火

04
虎/金

20
狗/土

29
牛/水

41
牛/金

34
猴/金

+
23
羊/木

2025-03-24
083期
38
龙/木

25
蛇/金

08
狗/木

47
羊/火

33
鸡/金

32
狗/火

+
12
马/金

2025-03-23
082期
34
猴/金

39
兔/火

32
狗/火

10
猴/火

22
猴/水

27
兔/土

+
45
鸡/木

2025-03-22
081期
45
鸡/木

10
猴/火

20
狗/土

36
马/土

44
狗/水

02
龙/火

+
49
蛇/土
`
